{
    "1" : "The destination endpoint is inactive.",
    "2" : "The entity is inactive.",
    "3" : "Connection timed out.",
    "4" : "Received file errors",
    "5" : "Routing lookup failure",
    "6" : "SOAP Decryption Failed",
    "7" : "Destination Not Found",
    "8" : "Entity Not Found",
    "9" : "File too large",
    "10" : "Error authenticating x509 certificate",
    "11" : "Connector x509 certificate subject name does not match db profile",
    "12" : "Invalid security timestamp in SOAP message",
    "13" : "General WS-Security error",
    "14" : "General unhandled Broker error - see server logs for details",
    "15" : "Error validating request SOAP headers - see server logs for details",
    "16" : "Max Re-pull Attempts Without Acknowledgment Exceeded",
    "101" : "XSD validation violation",
    "102" : "Business Rule violation - Two or more UniqueAttachmentIDs assigned to a specific Separation Information Request are the same - they must be unique.",
    "110" : "Business Rule violation - There is no Employer URI lookup",
    "111" : "Business Rule violation - There must be a value (Date) for WagesNeededBeginDate if WagesWeeksNeededCode = WO|WW",
    "112" : "Business Rule violation - There must be a value (Date) for WagesNeededEndDate if WagesWeeksBeginDate is completed.",
    "115" : "Business Rule violation - ClaimEffectiveDate (Date) must be equal to or more recent than the RequestDate minus 6 years.",
    "116" : "Business Rule violation - BenefitYearBeginDate (Date) must be equal to or more recent than the RequestDate minus 6 years.",
    "117" : "Business Rule violation - ClaimantReportedFirstDayofWork (Date) must be in the past and more recent than RequestDate minus 100 years.                                   ",
    "118" : "Business Rule violation - ClaimantReportedLastDayofWork (Date) must be equal to or after ClaimantReportedFirstDayofWork.  ",
    "119" : "Business Rule violation - ClaimantReportedLastDayofWork (Date) must be more recent than the RequestDate minus 3 years and not more that the RequestDate plus 1 year in the future.",
    "120" : "Business Rule violation - WagesNeededBeginDate (Date) must be in the past and more recent than the RequestDate minus 18 months.",
    "121" : "Business Rule violation - WagesNeededEndDate (Date) must be in the past and more recent than the WagesNeededBeginDate.",
    "122" : "Business Rule violation - ReturntoWorkDate (Date) must be after ClaimEffectiveDate and not more than the RequestDate plus 1 year in the future.",
    "123" : "Business Rule violation - RequestDate (Date) must be greater than or equal to the current date minus 1 day and not more than the current date plus 6 months in the future (State and Broker rule only).",
    "124" : "Business Rule violation - ResponseDueDate (Date) must be at least the number of predefined days for the given State after RequestDate and not more than 24 days after Request Date.",
    "125" : "Business Rule violation - WagesNeededEndDate (Date) must be null if WagesNeededBeginDate is null.",
    "201" : "XSD validation violation",
    "202" : "Business Rule violation - Two or more UniqueAttachmentIDs assigned to a specific Separation Information Response are the same - they must be unique.",
    "210" : "Business Rule violation - There is no matching Claim Request record with the backfilled fields, RequestGUID and BrokerRecordTransactionNumber.",
    "211" : "Business Rule violation - There must be a value (Character - Size 1) for TotalEarnedWagesNeededInd if WagesWeeksNeededCode = WO|WW and EmployerSepReasonCode does not equal 20 or 21",
    "212" : "Business Rule violation - There must be a value (Numeric - Size 15.2) for TotalEarnedWages if TotalEarnedWagesNeededInd = 1 for Wages are Available",
    "213" : "Business Rule violation - There must be a value (Character - Size 1) for TotalWeeksWorkedNeededInd if WagesWeeksNeededCode = WW and EmployerSepReasonCode does not equal 20 or 21",
    "214" : "Business Rule violation - There must be a value (Numeric - Size 2) for TotalWeeksWorked if TotalWeeksWorkedNeededInd = 1 for Weeks are Available",
    "215" : "Business Rule violation - There must be a value (Numeric - Size 2) for NumberOfHoursWorkedAfterClaimEffectiveDate if WagesEarnedAfterClaimEffectiveDate > 0",
    "216" : "Business Rule violation - There must be a value (Numeric - Size 15.2) for AverageWeeklyWage if Remuneration included",
    "217" : "Business Rule violation - There must be a value (Character - Size 1 - Values Y|N) for ReturnToWorkInd if EmployerSepReasonCode is 4 for Vacation/Holiday Shutdown or is 7 for School Employee Between Semesters or Terms, Likely to Return or is 17 for Professional Athlete Between Sports Seasons or is 1 for Temporary Layoff or is 15 for Disciplinary Suspension",
    "218" : "Business Rule violation - There must be a value (Date) for ReturnToWorkDate if ReturnToWorkInd  = 'Y'.",
    "219" : "Business Rule violation - There must be a value (Character - Size 2 - Values Y|N|99) for WorkingAllAvailableHoursInd if EmployerSepReasonCode is 11 for Still Employed, Hours Reduced by Employer",
    "220" : "Business Rule violation - There must be a value (Character -Size 500) for NotWorkingAvailableHoursReason if WorkingAllAvailableHoursInd = N",
    "221" : "Business Rule violation - There must be a value (Character - Size 1 - Values S|L) for LaborDisputeTypeInd if EmployerSepReasonCode is 16 for Labor Dispute",
    "222" : "Business Rule violation - There must be a value (Date) for AllocationBeginDate in Remuneration Sequence Number ${sequencenumber} if EmployerAllocationCode is Y",
    "223" : "Business Rule violation - There must be a value (Date) for AllocationEndDate in Remuneration Sequence Number ${sequencenumber} if EmployerAllocationCode is Y",
    "224" : "Business Rule violation - There must be a value (Numeric - Size 2) for AverageNumberHoursWorkedPerWeek if Remuneration included",
    "225" : "Business Rule violation - There must be a value (Character - Size 1 - Values Y|N) for MandatoryRetirementInd if EmployerSepReasonCode = 14 for Retirement",
    "226" : "Business Rule violation - There must be a value (Character - Size 1 - Values Y|N) for MandatoryPension if any entry for RemunerationTypeCode = 5 for Pension",
    "227" : "Business Rule violation - There must be a value (Character - Size 1 - Values Y|N) for ContributoryOrNotContributoryClaimantInd if any entry for RemunerationTypeCode = 5 for Pension",
    "228" : "Business Rule violation - There must be a value (Numeric - Size 3) for ClaimantPensionContibutionPercent if ContributoryOrNotContributoryClaimantInd is Y",
    "229" : "Business Rule violation - There must be a value (Character - Size 2000) for EmployerSepReasonComments if EmployerSepReasonCode is other than 3 for Discharged, 6 for Voluntary Quit, 1 for Temporary Layoff, 2 for Laid Off/Lack of Work, or 99 for Refuse to Provide.",
    "230" : "Business Rule violation - There must be a value (Character - Size 2 - Value 1-8) for DischargeReasonCode if EmployerSepReasonCode is 3 for Discharged or 5 for Asked to Resign or if VoluntarySepReasonCode is 5 for In Lieu of Discharge.",
    "231" : "Business Rule violation - There must be a value (Character - Size 1000)  for FinalIncidentReason if DischargedReasonCode is 2-8",
    "232" : "Business Rule violation - There must be a value (Date) for FinalIncidentDate if FinalIncidentReason is completed",
    "233" : "Business Rule violation - There must be a value (Character - Size 1 - Values Y|N)  for ViolateCompanyPolicyInd if DischargeReasonCode is 2-8",
    "234" : "Business Rule violation - There must be a value (Character - Size 1 - Values Y|N) for DischargePolicyAwareInd if ViolateCompanyPolicyInd is Y",
    "235" : "Business Rule violation - There must be a value (Character - Size 1 - Values W|V) for DischargePolicyAwareExplainationCode if DischargePolicyAwareInd is Y",
    "236" : "Business Rule violation - There must be a value (Date) for PriorIncidentWarningDate in Prior Incident Sequence Number ${sequencenumber} if PriorIncidentWarningInd is Y",
    "237" : "Business Rule violation - There must be a value (Character - Size 1000) for PriorIncidentWarningDescription in Prior Incident Sequence Number ${sequencenumber} if PriorIncidentWarningInd is Y",
    "238" : "Business Rule violation - There must be a value (Character - Size 60) for WhoDischargedName if DischargeReasonCode is included",
    "239" : "Business Rule violation - There must be a value (Character - Size 60) for WhoDischargedTitle if DischargeReasonCode is included",
    "240" : "Business Rule violation - There must be a value (Character - Size 1000) for DischargeReasonComments if DischargeReasonCode is 8 for Not Listed Above",
    "241" : "Business Rule violation - There must be a value (Character - Size 2 - Values 1-10 or 99) for VoluntarySepReasonCode if EmployerSepReasonCode is 6 for Voluntary Quit",
    "242" : "Business Rule violation - There must be a value (Character - Size 1 - Values 1-6) for HiringAgreementChangeCode if VoluntarySepReasonCode is 9 for Working Conditions",
    "243" : "Business Rule violation - There must be a value (Character - Size 1000) for HiringAgreementChangeComments if HiringAgreementChangeCode is 2-6",
    "244" : "Business Rule violation - There must be a value (Character - Size 1 - Values Y|N) for ClaimantActionsAvoidQuitInd if VoluntarySepReasonCode is included",
    "245" : "Business Rule violation - There must be a value (Character - Size 1000)  for ActionTakenComments if VoluntarySepReasonCode is included and if ClaimantActionsToAvoidQuitInd = Y",
    "246" : "Business Rule violation - There must be a value (Character - Size 1 - Values Y|N) for ContinuingWorkAvailableInd if VoluntarySepReasonCode is included",
    "247" : "Business Rule violation - There must be a value (Character - Size 2000)  for VoluntarySepReasonComments if VoluntarySepReasonCode is 10 for Not Listed Above",
    "248" : "Business Rule violation - There must be a value (Character - Size 60) for PreparerCompanyName if PreparerTypeCode = T for Third Party Administrator",
    "249" : "Business Rule violation - If PreparerTypeCode is 'E' for employer, then valid EmployerSepReasonCode (B-20) codes are 1-20 or 99.  If PreparerTypeCode is 'T' for Third Party Administrator then valid EmployerSepReasonCode (B-20) codes are 1-21 or 99.",
    "250" : "Business Rule violation - If the value for EmployerSepReasonCode is 21 for TPA does not represent this employer then the value for PreparerTypeCode must be T for Third Party Administrator",
    "251" : "Business Rule violation - EmployerReportedClaimantFirstDayofWork (Date) must be in the past and more recent than the RequestDate minus 100 years.",
    "252" : "Business Rule violation - EmployerReportedClaimantFirstDayofWork (Date) must be before or equal to EmployerReportedClaimantLastDayofWork.",
    "253" : "Business Rule violation - EmployerReportedClaimantLastDayofWork (Date) must be in the past.",
    "254" : "Business Rule violation - EmployerReportedClaimantLastDayofWork (Date) must be after or equal to EmployerReportedClaimantFirstDayofWork.",
    "255" : "Business Rule violation - EffectiveSeparationDate (Date) must be in the past.",
    "256" : "Business Rule violation - ReturnToWorkDate (Date) must be after ClaimEffectiveDate",
    "257" : "Business Rule violation - FinalIncidentDate (Date) must be in the past",
    "258" : "Business Rule violation - PriorIncidentDate (Date) in Prior Incident Sequence Number ${sequencenumber} must be in the past",
    "259" : "Business Rule violation - PriorIncidentWarningDate (Date) in Prior Incident Sequence Number ${sequencenumber} must be in the past.",
    "260" : "Business Rule violation - AmendedResponseDescription (Character - Size 2000) cannot be empty when AmendedResponse is not null.",
    "261" : "Business Rule violation - EffectiveSeparationDate (Date) must be after or equal to EmployerReportedClaimantLastDayofWork and not more than the RequestDate plus 1 year in the future.",
    "262" : "Responding Employer/TPA does not match the Employer/TPA that the request was sent to",
    "263" : "State that the Employer/TPA is responding to does not match the State that the request was sent from",
    "264" : "Business Rule violation - OtherSSN (Character - Size 9) cannot equal the SSN used for the claim.",
    "265" : "Business Rule violation - EmployerReportedClaimantLastDayofWork (Date) must be equal to or prior to the RequestDate plus 1 year",
    "266" : "Business Rule violation - ReturnToWorkDate (Date) must be after EffectiveSeparationDate and not more than the RequestDate plus 1 year in the future.",
    "267" : "Business Rule violation - DateRemunerationIssued (Date) ${sequencenumber} must be between the ClaimEffectiveDate minus 2 years and RequestDate plus 5 years.",
    "268" : "Business Rule violation - AllocationBeginDate (Date) ${sequencenumber} must be more recent than or equal to EmployerReportedClaimantLastDayWork and not more than the RequestDate plus 1 year in the future.",
    "269" : "Business Rule violation - AllocationBeginDate (Date) ${sequencenumber} must be more recent than or equal to ClaimEffectiveDate minus 1 year and not more than RequestDate plus 1 year in the future.",
    "270" : "Business Rule violation - AllocationEndDate (Date) ${sequencenumber} must be more recent than or equal to AllocationBeginDate and not more than AllocationBeginDate plus 3 years.",
    "271" : "Business Rule violation - AllocationEndDate (Date) ${sequencenumber} must be null if AllocationBeginDate is null.",
    "272" : "Business Rule violation - PriorIncidentDate (Date) ${sequencenumber} must be prior to FinalIncidentDate.",
    "273" : "Business Rule violation - PriorIncidentDate (Date) ${sequencenumber} must be equal to or more recent than the RequestDate minus 7 years.",
    "274" : "Business Rule violation - PriorIncidentWarningDate (Date) ${sequencenumber} must be more recent than or equal to PriorIncidentDate and prior to the RequestDate.",
    "275" : "Business Rule violation - EffectiveSeparationDate (Date) must be null if EmployerReportedClaimantLastDayofWork is null.",
    "276" : "Business Rule violation - FinalIncidentDate (Date) must be prior to the RequestDate and equal to or more recent than the RequestDate minus 7 years.",
    "277" : "Business Rule violation - If EmployerReportedClaimantFirstDayOfWork is null, EmployerReportedClaimantLastDayOfWork (Date) must be after or equal to RequestDate minus 6 years and not more than the RequestDate plus 1 year in the future.",
    "278" : "Business Rule violation - The must be at least one Remuneration if RemunerationInd = Y.",
    "279" : "Business Rule violation - The must not a Remuneration if RemunerationInd = N.",
    "280" : "Business Rule violation - There must not be an AllocationBeginDate in Remuneration ${sequencenumber} if EmployerAllocationInd = N",
    "281" : "Business Rule violation - There must not be an AllocationEndDate in Remuneration ${sequencenumber} if EmployerAllocationInd = N",
    "282" : "Business Rule violation - There must be a RemunerationInd when EmployerSepReasonCode does not equal 1 through 19.",
    "283" : "Business Rule violation - There must be an EmployerReportedClaimantLastDayofWork when EmployerSepReasonCode does not equal 20, 21, or 99.",
    "284" : "Business Rule violation - RemunerationInd must be null if EmployerSepReasonCode is 20 or 21",
    "301" : "XSD validation violation                                                                                                                                                                                                                                                                                                                                                                                                                              ",
    "310" : "Deprecated                                                                                                                                                                                                                                                                                                                                                                                                                                            ",
    "311" : "Deprecated                                                                                                                                                                                                                                                                                                                                                                                                                                            ",
    "312" : "Business Rule violation - The EarningsVerificationWeekBeginDate thru EarningsVerificationWeekEndDate does not divide evenly by 7 days.                                                                                                                                                                                                                                                                                                                ",
    "315" : "Business Rule violation - There must be a value for PIN (Character - Size 20) if the record is part of an E-Response bundle file.                                                                                                                                                                                                                                                                                                                     ",
    "316" : "Business Rule violation - PIN (Character - Size 20) must be null if the record is not part of an E-Response bundle file.                                                                                                                                                                                                                                                                                                                              ",
    "317" : "Business Rule violation -  EarningsVerificationWeekBeginDate (Date) must be at least 7 days prior to RequestDate and more recent than RequestRate minus 1 year                                                                                                                                                                                                                                                                                        ",
    "318" : "Business Rule violation - EarningsVerificationWeekEndDate (Date) must be prior to or equal to RequestDate and greater than or equal to EarningsVerificationWeekBeginDate.                                                                                                                                                                                                                                                                             ",
    "319" : "Business Rule violation -  RequestDate (Date) must be greater than the current date minus 1 day and less than the current date plus 6 months (State and Broker rule only).                                                                                                                                                                                                                                                                            ",
    "320" : "Business Rule violation -  ResponseDueDate (Date) must be at least the number of predefined days for the given State after RequestDate and not more than 2 times the days defined for the given State after RequestDate.                                                                                                                                                                                                                              ",
    "321" : "Business Rule violation -  StateEmployerAccountNumber (Character - Size 20) is required if EarningsVerificationSourceCode = 2 for State Directory of New Hire or 3 for Quarterly Cross Match                                                                                                                                                                                                                                                          ",
    "322" : "Business Rule violation - OriginatingStateHitFIPSCode (Character - Size 2) must be filled in if EarningsVerificationSourceCode is 4 for Interstate Crossmatch.                                                                                                                                                                                                                                                                                        ",
    "323" : "Business Rule violation - The number of weeks between EarningsVerificationWeekBeginDate (Date) and EarningVerificationWeekEndDate (Date) must be less than or equal to 15 weeks.                                                                                                                                                                                                                                                                      ",
    "324" : "Business Rule violation - EarningsVerificationWeekBeginDate (Date) must fall on a Sunday unless the state is NY, where it must fall on a Monday.                                                                                                                                                                                                                                                                                                      ",
    "401" : "XSD validation violation                                                                                                                                                                                                                                                                                                                                                                                                                              ",
    "410" : "Business Rule violation - There is no matching Claim Request record with fields matching the backfilled fields, the StateEarningsVerificationRequestRecordGUID, and the BrokerRecordTransactionNumber.                                                                                                                                                                                                                                                ",
    "411" : "Business Rule violation - There must be a value (Character - Size 1) for EmployerEarningsCode if ClaimantEmployerWorkRelationshipCode = 1 for The Claimant works/worked for the Employer                                                                                                                                                                                                                                                              ",
    "412" : "Business Rule violation - There must be a value (Date) for FirstDayWorkedinPeriod if EmployerEarningsCode = 1 for Yes, this individual had earnings during the time frame requested or 2 for Claimant performs work and did not have earnings (100% sales person)                                                                                                                                                                                     ",
    "413" : "Business Rule violation - The value (Date) for FirstDayWorkedinPeriod must be between EarningsVerificationWeeksBeginDate and EarningsVerificationEndDate if included.                                                                                                                                                                                                                                                                                 ",
    "414" : "Business Rule violation - There must be a value (Character - Size 1) for StillWorkingCode if EmployerEarningsCode = 1 for Yes, this individual had earnings during the time frame requested or 2 for Claimant performs work and did not have earnings (100% sales person)                                                                                                                                                                             ",
    "415" : "Business Rule violation - There must be a value (Date) for LastDayWorked if StillWorkingCode = 2 for No                                                                                                                                                                                                                                                                                                                                               ",
    "416" : "Business Rule violation - There must be a value (Character - Size 2) for EmployerSepReasonCode if StillWorkingCode = 2 for No                                                                                                                                                                                                                                                                                                                         ",
    "417" : "Business Rule Violation - EarningsVerificationResponseComment (Character - Size 1000) must be null when EarningsVerificationResponseCommentIndicator in the Request equals 2 for No                                                                                                                                                                                                                                                                   ",
    "418" : "Deprecated                                                                                                                                                                                                                                                                                                                                                                                                                                            ",
    "419" : "Deprecated                                                                                                                                                                                                                                                                                                                                                                                                                                           ",
    "420" : "Deprecated                                                                                                                                                                                                                                                                                                                                                                                                                                            ",
    "421" : "Deprecated                                                                                                                                                                                                                                                                                                                                                                                                                                            ",
    "422" : "Business Rule violation - All EVDay (Date) entries must be unique in Repeatable Earnings Verification                                                                                                                                                                                                                                                                                                                                                 ",
    "423" : "Deprecated                                                                                                                                                                                                                                                                                                                                                                                                                                            ",
    "424" : "Business Rule violation - There must be a value (Numeric - 7.2) for AmountEarnedForDay in Repeatable Earnings Verification ${sequencenumber} if HoursWorked > 0.                                                                                                                                                                                                                                                                                              ",
    "425" : "Business Rule violation - The value (Numeric - 7.2) for AmountEarnedForDay in Repeatable Earnings Verification ${sequencenumber} must be 0 if HoursWorked = 0.                                                                                                                                                                                                                                                                                                ",
    "426" : "Business Rule violation - There must be a value (Date) for EarningsPaidDate in Repeatable Earnings Verification ${sequencenumber} if EarningsStatusCode (from Request) = 3 for Field Required, Date Required, Date Paid or 4 for Field Required, Date Required, Date Allocated and AmountEarnedForDay is > 0                                                                                                                                                  ",
    "427" : "Business Rule violation - There cannot be a value (Date) for EarningsPaidDate in Repeatable Earnings Verification ${sequencenumber} if EarningsStatusCode (from Request) = 2 for Field Required, Date Not Required                                                                                                                                                                                                                                            ",
    "428" : "Deprecated",
    "429" : "Deprecated",
    "430" : "Business Rule violation - There must be a value (Date) for TipsPaidDate in Repeatable Earnings Verification ${sequencenumber} if TipsStatusCode (from Request) = 3 for Field Required, Date Required, Date Paid or 4 for Field Required, Date Required, Date Allocated and TipsAmountEarnedForDay is > 0                                                                                                                                                      ",
    "431" : "Business Rule violation - There cannot be a value (Date) for TipsPaidDate in Repeatable Earnings Verification ${sequencenumber} if TipsStatusCode (from Request) = 1 for Field not present/required or 2 for Field Required, Date Not Required                                                                                                                                                                                                                ",
    "432" : "Deprecated",
    "433" : "Deprecated",
    "434" : "Business Rule violation - There must be a value (Date) for CommissionPaidDate in Repeatable Earnings Verification ${sequencenumber} if CommissionStatusCode (from Request) = 3 for Field Required, Date Required, Date Paid or 4 for Field Required, Date Required, Date Allocated and CommissionAmountEarnedForDay is > 0                                                                                                                                    ",
    "435" : "Business Rule violation - There cannot be a value (Date) for CommissionPaidDate in Repeatable Earnings Verification ${sequencenumber} if CommissionStatusCode (from Request) = 2 for Field Required, Date Not Required                                                                                                                                                                                                    ",
    "436" : "Deprecated",
    "437" : "Deprecated",
    "438" : "Business Rule violation - There must be a value (Date) for BonusPaidDate if BonuesStatusCode (from Request) = 3 for Field Required, Date Required, Date Paid or 4 for Field Required, Date Required, Date Allocated and BonusAmountEarnedForDay is > 0                                                                                                                                                                                                ",
    "439" : "Business Rule violation - There cannot be a value (Date) for BonusPaidDate in Repeatable Earnings Verification ${sequencenumber} if BonusStatusCode (from Request) = 2 for Field Required, Date Not Required                                                                                                                                                                                                              ",
    "440" : "Deprecated",
    "441" : "Deprecated",
    "442" : "Business Rule violation - There must be a value (Date) for VacationPaidDate if VacationStatusCode (from Request) = 3 for Field Required, Date Required, Date Paid or 4 for Field Required, Date Required, Date Allocated and VacationAmountPaidForWeek is > 0                                                                                                                                                                                         ",
    "443" : "Business Rule violation - There cannot be a value (Date) for VacationPaidDate in Repeatable Earnings Verification ${sequencenumber} if VacationStatusCode (from Request) = 2 for Field Required, Date Not Required                                                                                                                                                                                                        ",
    "444" : "Deprecated",
    "445" : "Deprecated",
    "446" : "Business Rule violation - There must be a value (Date) for SickPaidDate if SickStatusCode (from Request) = 3 for Field Required, Date Required, Date Paid or 4 for Field Required, Date Required, Date Allocated and SickAmountPaidForWeek is > 0                                                                                                                                                                                                     ",
    "447" : "Business Rule violation - There cannot be a value (Date) for SickPaidDate in Repeatable Earnings Verification ${sequencenumber} if SickStatusCode (from Request) = 2 for Field Required, Date Not Required                                                                                                                                                                                                                ",
    "448" : "Deprecated",
    "449" : "Deprecated",
    "450" : "Business Rule violation - There must be a value (Date) for HolidayPaidDate in Repeatable Earnings Verification ${sequencenumber} if HolidayStatusCode (from Request) = 3 for Field Required, Date Required, Date Paid or 4 for Field Required, Date Required, Date Allocated and HolidayAmountPaidForWeek is > 0                                                                                                                                              ",
    "451" : "Business Rule violation - There cannot be a value (Date) for HolidayPaidDate in Repeatable Earnings Verification ${sequencenumber} if HolidayStatusCode (from Request) = 2 for Field Required, Date Not Required                                                                                                                                                                                                          ",
    "452" : "Deprecated",
    "453" : "Deprecated",
    "454" : "Business Rule violation - There must be a value (Date) for SeverancePaidDate in Repeatable Earnings Verification ${sequencenumber} if SeveranceStatusCode (from Request) = 3 for Field Required, Date Required, Date Paid or 4 for Field Required, Date Required, Date Allocated and SeveranceAmountPaidForWeek is > 0                                                                                                                                        ",
    "455" : "Business Rule violation - There cannot be a value (Date) for SeverancePaidDate in Repeatable Earnings Verification ${sequencenumber} if SeveranceStatusCode (from Request) = 2 for Field Required, Date Not Required                                                                                                                                                                                                      ",
    "456" : "Deprecated",
    "457" : "Deprecated",
    "458" : "Business Rule violation - There must be a value (Date) for WagesInLieuPaidDate in Repeatable Earnings Verification ${sequencenumber} if WagesInLieuStatusCode (from Request) = 3 for Field Required, Date Required, Date Paid or 4 for Field Required, Date Required, Date Allocated and WagesInLieuAmountPaidForWeek is > 0                                                                                                                                  ",
    "459" : "Business Rule violation - There cannot be a value (Date) for WagesInLieuPaidDate in Repeatable Earnings Verification ${sequencenumber} if WagesInLieuStatusCode (from Request) = 2 for Field Required, Date Not Required                                                                                                                                                                                                  ",
    "460" : "Business Rule violation - There must be a value (Character - Size 60) for PreparerCompanyName if PreparerTypeCode = T for Third Party Administrator                                                                                                                                                                                                                                                                                                   ",
    "461" : "Business Rule violation - AmendedResponseDescription (Character - Size 2000) cannot be empty when AmendedResponse is not null                                                                                                                                                                                                                                                                                                                         ",
    "462" : "Responding Employer/TPA does not match the Employer/TPA to which  the request was sent                                                                                                                                                                                                                                                                                                                                                                ",
    "463" : "State to which the employer or TPA is responding does not match the State from which  the request was sent                                                                                                                                                                                                                                                                                                                                            ",
    "464" : "Business Rule violation -  EarningsPaidDate (Date) in Repeatable Earnings Verification ${sequencenumber} must be more recent than or equal to EVDay and not more than EVDay plus 1 year.                                                                                                                                                                                                                                                  ",
    "465" : "Business Rule violation - TipsPaidDate (Date) in Repeatable Earnings Verification ${sequencenumber} must be more recent than or equal to EVDay and not more than EVDay plus 1 year.                                                                                                                                                                                                                                                       ",
    "466" : "Business Rule violation -  CommissionPaidDate (Date) in Repeatable Earnings Verification ${sequencenumber} must be more recent than or equal to EVDay and not more than EVDay plus 1 year.                                                                                                                                                                                                                                                ",
    "467" : "Business Rule violation -  BonusPaidDate (Date) in Repeatable Earnings Verification ${sequencenumber} must be more recent than or equal to EVDay and not more than EVDay plus 1 year.                                                                                                                                                                                                                                                     ",
    "468" : "Business Rule violation -  VacationPaidDate (Date) in Repeatable Earnings Verification ${sequencenumber} must be more recent than or equal to EVDay and not more than EVDay plus 1 year.                                                                                                                                                                                                                                                  ",
    "469" : "Business Rule violation -  SickPaidDate (Date) in Repeatable Earnings Verification ${sequencenumber} must be more recent than or equal to EVDay and not more than EVDay plus 1 year.                                                                                                                                                                                                                                                      ",
    "470" : "Business Rule violation -  HolidayPaidDate (Date) in Repeatable Earnings Verification ${sequencenumber} must be more recent than or equal to EVDay and not more than EVDay plus 1 year.                                                                                                                                                                                                                                                   ",
    "471" : "Business Rule violation -  SeverancePaidDate (Date) in Repeatable Earnings Verification ${sequencenumber} must be more recent than or equal to EVDay and not more than EVDay plus 1 year.                                                                                                                                                                                                                                                 ",
    "472" : "Business Rule violation -  WagesInLieuPaidDate (Date) in Repeatable Earnings Verification ${sequencenumber} must be more recent than or equal to EVDay and not more than EVDay plus 1 year.                                                                                                                                                                                                                                               ",
    "473" : "Business Rule violation - LastDayWorked (Date) must be equal or prior to the current date and more recent than RequestDate minus 6 years.                                                                                                                                                                                                                                                                                                             ",
    "474" : "Business Rule violation - Must have one pay type, either RegularRateOfPay or TrainingPay or RatePerMile or RatePerTripOrLoadOrUnit, or ContractWage                                                                                                                                                                                                                                                                                                   ",
    "475" : "Business Rule violation - RegularRateOfPayPer is required if RegularRateOfPay is not null                                                                                                                                                                                                                                                                                                                                                             ",
    "476" : "Business Rule violation - RegularRateOfPay is required if OvertimeRateOfPay is specified                                                                                                                                                                                                                                                                                                                                                              ",
    "477" : "Business Rule violation - OvertimeRateOfPayPer is required if OvertimeRateOfPay is not null                                                                                                                                                                                                                                                                                                                                                           ",
    "478" : "Business Rule violation - TrainingPayPer is required if TrainingPay is not null                                                                                                                                                                                                                                                                                                                                                                       ",
    "479" : "Business Rule violation - ContractWageBeginDate and ContractWageEndDate must fall into the time period defined by EarningsVerificationWeekBeginDate and EarningsVerificationWeekEndDate                                                                                                                                                                                                                                                               ",
    "480" : "Business Rule violation - ContractWageBeginDate is required for each Contract                                                                                                                                                                                                                                                                                                                                                                         ",
    "481" : "Business Rule violation - ContractWageEndDate is required for each Contract                                                                                                                                                                                                                                                                                                                                                                           ",
    "482" : "Business Rule violation - ContractWageEndDate must be greater than or equal to ContractWageBeginDate                                                                                                                                                                                                                                                                                                                                                  ",
    "483" : "Business Rule violation - DayOfWeekPayPeriodEndDay is required if PayPeriod = W                                                                                                                                                                                                                                                                                                                                                                       ",
    "484" : "Business Rule violation - BiWeeklyPayPeriodStartDate is required if PayPeriod = B                                                                                                                                                                                                                                                                                                                                                                     ",
    "485" : "Business Rule violation - SemiMonthlyPayPeriod1StartDate is required if PayPeriod = S                                                                                                                                                                                                                                                                                                                                                                  ",
    "486" : "Business Rule violation - SemiMonthlyPayPeriod1EndDate is required if PayPeriod = S                                                                                                                                                                                                                                                                                                                                                                    ",
    "487" : "Business Rule violation - MonthlyPayPeriodEndDate is required if PayPeriod = M                                                                                                                                                                                                                                                                                                                                                                        ",
    "488" : "Business Rule violation - EmployerSeparationReasonComments must not be included if EmployerSeparationReasonCode = 1 for Lack of Work",
    "489" : "Business Rule violation - EmployerSeparationReasonComments must be included if EmployerSeparationReasonCode = 2 for Fired/Discharged, 3 for Voluntary Quit/Discharge, or 4 for Other",
    "490" : "Business Rule violation - The number of days between SemiMonthlyPayPeriod1BeginDate and SemiMonthlyPayPeriod1EndDate must be 14, 15, or 16.                                                                                                                                                                                                                                                                                                             ",
    "501" : "XSD validation violation",
    "502" : "Business Rule violation - Two or more UniqueAttachmentIDs assigned to a specific Monetary Request are the same. They must be unique.",
    "510" : "Business Rule violation - There is no Employer URI lookup.",
    "511" : "Business Rule violation - The ResponseDueDate (Date) is required if ResponseRequiredIndicator is Y",
    "512" : "Business Rule violation - The ResponseDueDate (Date) must be later than the RequestDate.",
    "513" : "Business Rule violation - The BasePeriodWagesThisEmplyer (Numeric - Size 16.2) must less than or equal to the BasePeriodWagesAllEmployers (if present).",
    "514" : "Business Rule violation - The BasePeriodWagesThisEmployer (Numeric - Size 16.2) must be equal to the sum of WagesInFirstQuarter, WagesInSecondQuarter, WagesInThirdQuarter and WagesInFourthQuarter if any are present.",
    "515" : "Business Rule violation - The BeginWeekNumber (Numeric - Size 2) must not overlap with any other week range in Repeatable Employer Charge ${sequencenumber}.",
    "516" : "Business Rule violation - The EndWeekNumber (Numeric - Size 2) must not overlap with any other week range in Repeatable Employer Charge ${sequencenumber}.",
    "517" : "Business Rule violation - The TotalWeeklyEmployerCharge (Numeric - Size 7.2) must be greater than 0 and cannot be larger than the MaximumBenefitAmount (if present).",
    "521" : "Business Rule violation - RequestDate (Date) must be greater than the current date minus 1 day (State and Broker rule only).",
    "522" : "Business Rule violation - ResponseDueDate (Date) must be at least the number of predefined days for the given State after Request Date",
    "523" : "Business Rule violation - BenefitYearBeginDate (Date) must be equal to or more recent than the current date minus 18 months.",
    "524" : "Business Rule violation - BasePeriodStartDate (Date) must be equal to or more recent than BenefitYearBegin Date minus 36 months.",
    "525" : "Business Rule violation - BasePeriodEndDate (Date) must equal BasePeriodStartDate plus 1 year.",
    "526" : "Business Rule violation - There must be an EmployerSepQuestionsShownInd (Character - Size 1) if the request is sent to an E-Response employer.",
    "527" : "Business Rule violation - There must not be an EmployerSepQuestionsShownInd (Character - Size 1) if the request is not sent to an E-Response employer.",
    "601" : "XSD validation violation",
    "602" : "Business Rule violation - Two or more UniqueAttachmentIDs assigned to a specific Monetary Response are the same. They must be unique.",
    "610" : "Business Rule violation - There is no matching Claim Request record with fields matching M-1 to MR-1, M-3 to MR-3, M-13 to MR-5, M-18 to MR-8, M-15 to MR-33, M-19 to MR-34, M-21 to MR-35, M-22 to MR-36, M-23 to MR-37, the StateMonetaryChargeRequestRecordGUID, and the BrokerRecordTransactionNumber.",
    "611" : "Business Rule violation - The OtherSSN (Character - Size 9) must not equal the SSN passed in the Request.",
    "612" : "Business Rule violation - The EmployerReportedDependents (Numeric - Size 1) must be null if Dependents for the Request is null.",
    "616" : "Business Rule violation - If PreparerTypeCode is E for employer, then valid EmployerSeparationReasonCode (Character - Size 2) codes are 1-20 or 99.  If PreparerTypeCode is T for Third Party Administrator then valid EmployerSeparationReasonCode (Character - Size 2) codes are 1-21 or 99",
    "627" : "Business Rule violation - If the value for EmployerSeparationReasonCode is 21 for TPA does not represent this employer then the value for PreparerTypeCode (Character - Size 1) must be T for Third-Party Administrator",
    "628" : "Business Rule violation - There must be a value (Character - Size 60) for PreparerCompanyName if PreparerTypeCode = T for Third Party Administrator",
    "629" : "Business Rule violation - AmendedResponseDescription (Character - Size 2000) cannot be empty when AmendedResponse is not null",
    "630" : "Responding Employer/TPA does not match the Employer/TPA to which  the request was sent ",
    "631" : "State to which the employer or TPA is responding does not match the State from which  the request was sent",
    "632" : "Business Rule violation - The LastDayWorked (Date) is required if EmployerSeparationReasonCode is not null and is not one of 9 = Still Employed - Full Time, 10 = Still Employed - Part Time, 11 = Still Employed - Hours Reduced by Employer, 19 = Other, 20  = Never Employed Here, 21 = TPA does not represent this employer or 99 = Not provided",
    "634" : "Business Rule violation - DischargeReasonCode (Character - Size 2) is required if EmployerSepReasonCode is 3 for Discharged or 5 for Asked to Resign.",
    "635" : "Business Rule violation - DischargeReasonCode (Character - Size 2) is required if VoluntarySepReasonCode is 5 for In Lieu of Discharge.",
    "636" : "Business Rule violation - DischargeReasonCode (Character - Size 2) must be null if EmployerSepReasonCode is not 3 for Discharged, 5 for Asked to Resign or 6 for Voluntary Quit and VoluntarySepReasonCode is not 5 for In Lieu of Discharge.",
    "637" : "Business Rule violation - VoluntarySepReasonCode (Character - Size 2) is required if EmployerSepReasonCode is 6 for Voluntary Quit.",
    "638" : "Business Rule violation - VoluntarySepReasonCode (Character - Size 2) must be null if EmployerSepReasonCode is not 6 for Voluntary Quit.",
    "639" : "Business Rule violation - EmployerResponseComments (Character - Size 2000) is required if RequestReliefofChargesInd is Y for Yes.",
    "640" : "Business Rule violation - RequestReliefofChargesInd (Character - Size 1) is required if RequestforReliefofChargesAllowedInd from the request is Y for Yes.",
    "641" : "Business Rule violation - RequestReliefofChargesInd (Character - Size 1) must be null if RequestforReliefofChargesAllowedInd from the request is N for No.",
    "642" : "Business Rule violation - EmployerCorrectedWageforFirstQuarter (Numeric - Size 15.2) must be null if WagesInFirstQuarter from the request is null.",
    "643" : "Business Rule violation - EmployerCorrectedWageforSecondQuarter (Numeric - Size 15.2) must be null if WagesInSecondQuarter from the request is null.",
    "644" : "Business Rule violation - EmployerCorrectedWageforThirdQuarter (Numeric - Size 15.2) must be null if WagesInThirdQuarter from the request is null.",
    "645" : "Business Rule violation - EmployerCorrectedWageforFourthQuarter (Numeric - Size 15.2) must be null if WagesInFourthQuarter from the request is null.",
    "646" : "Business Rule violation - EmployerCorrectedWageforTotalBasePeriod (Numeric - Size 16.2) must be null if BasePeriodWagesThisEmployer from the request is null.",
    "701" : "XSD validation violation ",
    "702" : "Business Rule violation - Two or more UniqueAttachmentIDs assigned to a specific Determination Decision Request are the same. They must be unique.",
    "710" : "Business Rule violation - There is no Employer URI lookup.",
    "711" : "Business Rule violation - RequestDate (Date) must be greater than or equal to the current date minus 1 day (State and Broker rule only).",
    "712" : "Business Rule violation - LastDateToAppeal (Date) must be at least the number of predefined days for the given State after RequestDate.",
    "713" : "Business Rule violation - The ClaimEffectiveDate (Date) must be before the RequestDate and greater than the RequestDate minus 6 years.",
    "714" : "Business Rule violation - The BenefitYearBeginDate  (Date) must be before the RequestDate and greater than the RequestDate minus 6 years.",
    "715" : "Business Rule violation - The DeterminationOrDecisionDate (Date) must be greater than the BenefitYearBeginDate.",
    "716" : "Business Rule violation - The DeterminationOrDecisionResult (Character Size 2) value of 11 or 19 can only be used if DeterminationOrDecisionInd equals 30, 31, 32, or 33.",
    "717" : "Business Rule violation - There must be a value for PIN (Character - Size 20) if the record is part of an E-Response bundle file.",
    "718" : "Business Rule violation - PIN (Character - Size 20) must be null if the record is not part of an E-Response bundle file.",
    "719" : "Business Rule violation - There must be a value for LastDateToAppeal (Date) if AppealableDeterminationOrDecision is 1 or 2.",
    "720" : "Business Rule violation - ActionableAttachment (Character - Size 2) can only have one value of 11, 12, 13, or 14 per record.",
    "801" : "XSD validation violation ",
    "802" : "Business Rule violation - Two or more UniqueAttachmentIDs assigned to a specific Determination Decision Response are the same. They must be unique.",
    "810" : "Business Rule violation - There is no matching Claim Request record with fields matching the backfilled fields, the StateDeterminationDecisionChargeRequestRecordGUID, and the BrokerRecordTransactionNumber.",
    "811" : "Business Rule violation - The EmployerRequestingRedetOrAppealOfDeterminationOrDecision (Character - Size 1) is required if DeterminationOrDecision from the Request is 1 and TPAToEmployerRelationship does not equal 21.",
    "812" : "Business Rule violation - The EmployerRequestingRedetOrAppealOfDeterminationOrDecision (Character - Size 1) must be null if TPAToEmployerRelationship equals 21.",
    "813" : "Business Rule violation - The AppealReasonIndicator (Character - Size 2) required if EmployerRequestingRedetOrApppealOfDeterminationOrDecision is equal to Y otherwise it must be null.",
    "814" : "Business Rule violation - The EmployerReasonRequestingRedetOrAppeal (Character - Size 2000) required if EmployerRequestingRedetOrApppealOfDeterminationOrDecision is equal to Y otherwise it must be null.",
    "815" : "Business Rule violation - The EmployerReasonLateAppeal (Character - Size 2000) required if LastDateToAppeal is greater than the current date (Employer/TPA and Broker Rule only).",
    "816" : "Business Rule violation - The AgentType (Character - Size 1) required if AgentResponseIndicator from the Request is 1, otherwise must be null.",
    "817" : "Business Rule violation - The AgentAttorneyName (Character - Size 50) required if AgentType equals 2 or 3, otherwise must be null.",
    "818" : "Business Rule violation - The AgentAttorneyAddress1 (Character - Size 35) required if AgentType equals 2 or 3, otherwise must be null.",
    "819" : "Business Rule violation - The AgentAttorneyAddress2 (Character - Size 35) must be null if AgentType does not equal 2 or 3.",
    "820" : "Business Rule violation - The AgentAttorneyCity (Character - Size 19) required if AgentType equals 2 or 3, otherwise must be null.",
    "821" : "Business Rule violation - The AgentAttorneyState (Character - Size 2) required if AgentType equals 2 or 3, otherwise must be null.",
    "822" : "Business Rule violation - The AgentAttorneyZip (Character - Size 10) required if AgentType equals 2 or 3, otherwise must be null.",
    "823" : "Business Rule violation - The AgentAttorneyTelephoneNumberPlusExt (Character - Size 15) required if AgentType equals 2 or 3, otherwise must be null.",
    "824" : "Business Rule violation - The DatesTimesUnavailable (Character - Size 500) optional only if NotAvailableIndicator from Request is 1, otherwise must be null.",
    "825" : "Business Rule violation - The InterpreterLanguage (Character - Size 100) optional only if InterpreterIndicator from Request is 1, otherwise must be null.",
    "826" : "Business Rule violation - The SpecialNeeds (Character - Size 500) optional only if SpecialNeedsIndicator from Request is 1, otherwise must be null.",
    "827" : "Business Rule violation - PreparerCompanyName  (Character - Size 60) required if PreparerTypeCode = T for Third Party Administrator.",
    "828" : "Business Rule violation - TPAToEmployerRelationship (Character - Size 2) may only be answered if PreparerTypeCode = T for Third Party Administrator.",
    "829" : "Business Rule violation - AmendedResponseDescription (Character - Size 2000) cannot be empty when AmendedResponse is not null.",
    "830" : "Responding Employer/TPA does not match the Employer/TPA to which  the request was sent.",
    "831" : "State to which the employer or TPA is responding does not match the State from which  the request was sent.",
    "832" : "Business Rule violation - AppealableDeterminationOrDecision in Request from State does not permit a response. ",
    "833" : "Business Rule violation - EmpWorksiteZip (Character - Size 10) must be either a 5 digit number (U.S. and Mexico), a 5 digit number followed by a dash and a 4 digit number (U.S.), or a Canadian zip.",
    "834" : "Business Rule violation - AgentAttorneyZip (Character - Size 10) must be either a 5 digit number (U.S. and Mexico), a 5 digit number followed by a dash and a 4 digit number (U.S.), or a Canadian zip.",
    "901" : "XSD validation violation ",
    "902" : "Business Rule violation - two or more UniqueAttachmentIds assigned to a specific Benefit Charges request are the same. They must be unique.",
    "903" : "Null data or whitespace in field ",
    "904" : "Date with greater than 4 digit year",
    "910" : "Business Rule violation - there is no employer URI lookup.",
    "911" : "Business Rule violation - NoticeDate (date) must be greater than or equal to the current date minus 1 day and less than current date plus 6 months (state and broker rule only).",
    "912" : "Business Rule violation - LastDayToRespond (date) is required if DueDateRequiredInd is Y otherwise it must be null.",
    "913" : "Business Rule violation - LastDayToRespond (date) must be greater than or equal to NoticeDate plus a predefined number of days for a given state and cannot be greater than NoticeDate plus 366 days.",
    "914" : "Business Rule violation - the ChargeStatementStartDate (date) must be less than or equal to NoticeDate minus seven days and equal to or greater than the NoticeDate minus 13 months and seven days.",
    "915" : "Business Rule violation - the ChargeStatementEndDate (date) must be equal to or greater than 7 days after ChargeStatementStartDate and less than 93 days after ChargeStatementStartDate.",
    "916" : "Business Rule violation - the NumberOfIndividualSSNsWithCharges (positive integer) must equal the number of records reporting SSNBYBChargeProgramCode.",
    "917" : "Business Rule violation - the TotalDollarAmountChargedToEmployer (dollar amount) must equal the sum of charges listed in TotalAmountChargedToEmployer.",
    "918" : "Business Rule violation - the ReserveBalance (dollar amount) is required if ExperienceRatingMethod = 1.",
    "919" : "Business Rule violation - the ReserveBalance (dollar amount) must be null if ExperienceRatingMethod does not equal 1.",
    "920" : "Business Rule violation - the InvoiceNumber can only be filled in if at least one of ActionableAttachment equals 1 (invoice attached) and EmployerAccountType = 2 (Reimbursable Employer).",
    "921" : "Business Rule violation - the PaymentDueDate (date) is required if at least one of ActionableAttachment equals 1 and EmployerAccountType = 2 (Reimbursable Employer).",
    "922" : "Business Rule violation - the PaymentDueDate (date) must be null if no ActionableAttachment equals 1 or EmployerAccountType does not equal 2 (Reimbursable Employer).",
    "923" : "Business Rule violation - the PaymentDueDate (date) must be later than NoticeDate and not more than a predetermined number of days after NoticeDate for given state.",
    "924" : "Business Rule violation - the AmountDue (dollar amount) is required if at least one of ActionableAttachment equals 1.",
    "925" : "Business Rule violation - the AmountDue (dollar amount) must be null if none of ActionableAttachment equals 1.",
    "926" : "Business Rule violation - the BenefitYearBeginDate (date) must be at least 7 days prior to NoticeDate and cannot be more than 6 years before the NoticeDate.",
    "927" : "Business Rule violation - the ProgramCode (positive integer) is required if WeeklyCharge is not null.",
    "928" : "Business Rule violation - the BasePeriodStartDate (date) must be equal to or more recent than the BenefitYearBeginDate minus 79 weeks and at least 52 weeks prior to the BenefitYearBeginDate.",
    "929" : "Business Rule violation - the BasePeriodEndDate (date) must equal BasePeriodStartDate plus 53 weeks.",
    "930" : "Business Rule violation - if detail is provided in WeeklyCharge, the TotalAmountChargedToEmployer (dollar amount) must equal to the sum of dollars from DollarAmountChargedToEmployer for this SSN, Benefit Year Beginning Date, and Program Code.",
    "931" : "Business Rule violation - the TotalNumberOfWeeksChargedToEmployerAccount (positive integer) Must be equal to or greater than 1 and equal top or less than 106.",
    "932" : "Business Rule violation - if detail is provided in WeeklyCharge, the TotalNumberOfWeeksChargedToEmployerAccount (positive integer) must equal the number of weeks reported in WeekEndingDate is repeated for this SSN,  Benefit Year Beginning Date, Program Code, and ChargeCode.",
    "934" : "Business Rule violation - the WeekEndingDate (date) can not be repeated for the SSN, BYB, Program Code, and (ChargeCode is debit series (>=10 and < 20) or ChargeCode is credit series (>=20 and < 30)) combo.",
    "935" : "Business Rule violation - the PercentCharged (decimal) must be zero or greater and can not exceed 100.0000.",
    "936" : "Business Rule violation - the DollarAmountChargedToEmployer (dollar amount) must be less than or equal to TotalAmountPaid.",
    "937" : "Business Rule violation - Only one attachment with ActionableAttachment value of 1 is permitted.",
    "938" : "Business Rule violation - the AgentResponseIndicator (positive integer) must be 2 (No) if StateTerminologyUsed = 3 (Question).",
    "939" : "Business Rule violation - the NotAvailableIndicator (positive integer) must be 2 (No) if StateTerminologyUsed = 3 (Question).",
    "940" : "Business Rule violation - the InterpreterIndicator (positive integer) must be 2 (No) if StateTerminologyUsed = 3 (Question).",
    "941" : "Business Rule violation - the SpecialNeedsIndicator (positive integer) must be 2 (No) if StateTerminologyUsed = 3 (Question).",
    "942" : "Business Rule violation - there must be a value for PIN (character - size 20) if the record is part of an EResponse bundle file.",
    "943" : "Business Rule violation - PIN (character - size 20) must be null if the record is not part of an EResponse bundle file.",
    "944" : "Business Rule violation - Each SSNBYBChargeProgramCode element may only have up to 53 debit (ChargeCode is >=10 and < 20) and up to 53 credit (ChargeCode is >=20 and < 30) WeeklyCharge elements.",
    "945" : "Business Rule violation - If ProgramCode = 1 or 2, then WeekEndingDate (date) must be greater than BenefitYearBeginDate and less than BenefitYearBeginDate plus 53 weeks.",
    "946" : "Business Rule violation - If ProgramCode = 3, 4 or 5, then WeekEndingDate (date) must be greater than BenefitYearBeginDate and less than BenefitYearBeginDate plus 106 weeks.",
    "947" : "Business Rule violation - the TotalAmountPaid (dollar amount) can not be zero.",
    "948" : "Business Rule violation - If ChargeCode is 10 series then TotalAmountPaid must be positive, else TotalAmountPaid must be negative.",
    "949" : "Business Rule violation - the DollarAmountChargedToEmployer (dollar amount) must not be zero.",
    "950" : "Business Rule violation - An ActionableAttachment value of 1 is only permitted when EmployerAccountType = 2 (reimbursable employer).",
    "1001" : "XSD validation violation",
    "1002" : "Business Rule violation - two or more UniqueAttachmentIDs assigned to a specific Benefit Charges response SSN BYB Program Code are the same. they must be unique.",
    "1003" : "Null data or whitespace in field ",
    "1004" : "Date with greater than 4 digit year",
    "1010" : "Business Rule violation - there is no claim request record with fields matching the backfilled fields, the StateChargeRecordGUID and the BrokerRecordTransactionNumber.",
    "1011" : "Business Rule violation - there is no request SSNBYBChargeProgramCode with fields matching the backfilled fields in the response SSNBYBChargeProgramCode.",
    "1012" : "Business Rule violation - the EmployerReasonLateProtestAppeal (character - size 2000) is required if LastDayToRespond is in the request and current Date is greater than LastDayToRespond (Employer/TPA and Broker only rule).",
    "1013" : "Business Rule violation - the AgentType (Character - size 1) is required if request AgentResponseIndicator = 1.",
    "1014" : "Business Rule violation - the AgentType (Character - size 1) must be null if request AgentResponseIndicator is not equal to 1.",
    "1015" : "Business Rule violation - the AgentAttorneyName (Character - size 50) is required if AgentType is not equal to 1.",
    "1016" : "Business Rule violation - the AgentAttorneyName (Character - size 50) must be null if request AgentType = 1.",
    "1017" : "Business Rule violation - the AgentAttorneyAddress1 (Character - size 35) is required if AgentType is not equal to 1.",
    "1018" : "Business Rule violation - the AgentAttorneyAddress1 (Character - size 35) must be null if request AgentType = 1.",
    "1019" : "Deprecated",
    "1020" : "Business Rule violation - the AgentAttorneyAddress2 (Character - size 35) must be null if request AgentType = 1.",
    "1021" : "Business Rule violation - the AgentAttorneyCity (Character - size 19) is required if AgentType is not equal to 1.",
    "1022" : "Business Rule violation - the AgentAttorneyCity (Character - size 19) must be null if request AgentType = 1.",
    "1023" : "Business Rule violation - the AgentAttorneyState (Character - size 2) is required if AgentType is not equal to 1.",
    "1024" : "Business Rule violation - the AgentAttorneyState (Character - size 2) must be null if request AgentType = 1.",
    "1025" : "Business Rule violation - the AgentAttorneyZip (Character - size 10) is required if AgentType is not equal to 1.",
    "1026" : "Business Rule violation - the AgentAttorneyZip (Character - size 10) must be null if request AgentType = 1.",
    "1027" : "Business Rule violation - the AgentAttorneyTelephoneNumberPlusExt (Character - size 15) is required if AgentType is not equal to 1.",
    "1028" : "Business Rule violation - the AgentAttorneyTelephoneNumberPlusExt (Character - size 15) must be null if request AgentType = 1.",
    "1029" : "Business Rule violation - the DatesTimesUnavailable (Character - size 500) must be null if request NotAvailableIndicator equals 2.",
    "1030" : "Business Rule violation - the InterpreterLanguage (Character - size 100) must be null if request InterpreterIndicator equals 2.",
    "1031" : "Business Rule violation - the SpecialNeeds (Character - size 500) must be null if request SpecialNeedsIndicator equals 2.",
    "1032" : "Business Rule violation - the PreparerCompanyName (Character - size 60) is required if PreparerTypeCode = ''T'' for ''Third Party Administrator''.",
    "1033" : "Business Rule violation - the TPAToEmployerRelationship (positive integer) must be null if PreparerTypeCode does not equal ''T'' for ''Third Party Administrator''.",
    "1034" : "Business Rule violation - the AmendedResponseDescription (Character - size 2000) is required if AmendedResponse is not null.",
    "1035" : "Responding Employer/TPA does not match the Employer/TPA to which  the request was sent.",
    "1036" : "State to which the Employer/TPA is responding does not match the State from which the request was sent.",
    "1037" : "Business Rule violation - EmployerReasonForProtestAppealQuestion (Character - size 2000) is required if ProtestAppealQuestionReasonInd is not equal to 42 - A notice of claim was not received, 43 - Determination of eligibility not received, or 51 - Employer has no record of anyone ever having worked for them under this name or social security number.",
    "1038" : "Business Rule violation - TPAToEmployerRelationship must be 21 if SSNBYBChargeProgramCode is not included.",
    "1101" : "XSD validation violation",
    "1102" : "Null data or whitespace in field",
    "1103" : "Date with greater than 4 digit year",
    "1109" : "Business Rule violation - There is no Employer URI lookup.",
    "1110" : "Business Rule violation - RequestDate (date) must be greater than or equal to the current date minus 1 day and less than current date plus 6 months (state and broker rule only).",
    "1111" : "Business Rule violation - RequestDate (date) must be the day after the due date of the original response or immediately following the receipt the employer response.",
    "1112" : "Business Rule violation - RequestDate (date) must be less than 45 days from the corresponding exchange response date or due date; whichever happens first.",
    "1113" : "Business Rule violation - ResponseDueDate (date) must be greater than or equal to RequestDate plus a predefined number of days for a given state and cannot be more than 24 days after the RequestDate",
    "1114" : "Business Rule violation - ClaimEffectiveDate (date) must be equal to or more recent than the request date minus six years.",
    "1115" : "Business Rule violation - BenefitYearBeginDate (date) must be equal to or more recent than the request date minus six years.",
    "1116" : "Business Rule violation - RequestType (number) must be a 1, 2 or 3.",
    "1117" : "Business Rule violation - OtherExchangeBRTN (character - size 32) could not be found.",
    "1118" : "Business Rule violation - OtherExchangeBRTN/OtherExchangeRequestGUID (character - size 32) due date is in the future and no response record has been found.",
    "1119" : "Business Rule violation - Two or more InquiryNumbers are the same, they must be unique.",
    "1120" : "Business Rule violation - there must be a value for PIN (character - size 20) if the record is part of an EResponse bundle file.",
    "1121" : "Business Rule violation - PIN (character - size 20) must be null if the record is not part of an EResponse bundle file.",
    "1122" : "Business Rule violation - There is another Additional Fact-Finding request out on this OtherExchangeBRTN/OtherExchangeRequestGUID and Exchange that has not been responded to and is not passed the due date.",
    "1123" : "Business Rule violation - OtherExchangeRequestGUID (character - size 32)  could not be found.",
    "1124" : "Business Rule violation - OtherExchangeRequestGUID (character - size 32) does not match the record GUID in the request identified by the OtherExchangeBRTN.",
    "1201" : "XSD validation violation",
    "1202" : "Business Rule violation - two or more UniqueAttachmentIDs assigned to a specific Advanced Fact Finding request are the same - they must be unique.",
    "1203" : "Null data or whitespace in field",
    "1204" : "Date with greater than 4 digit year",
    "1210" : "Business Rule violation - There is no matching Claim Request record with fields matching the backfilled fields, the StateRequestRecordGUID, and the BrokerRecordTransactionNumber.",
    "1211" : "Business Rule violation - OtherSSN (character - size 9) cannot equal the SSN used in the claim.",
    "1212" : "Business Rule violation - the PreparerCompanyName (character - size 60) is required if PreparerTypeCode = 'T' for 'Third Party Administrator'.",
    "1213" : "Business Rule violation - the AmendedResponseDescription (character - size 2000) is required if AmendedResponse is not null.",
    "1214" : "Responding Employer/TPA does not match the Employer/TPA to which the request was sent.",
    "1215" : "State to which the Employer/TPA is responding does not match the State from which the request was sent.",
    "2001" : "XSD validation violation",
    "2002" : "Business Rule violation - Two or more UniqueAttachmentIDs assigned to a specific Separation Information Request are the same, they must be unique.",
    "2003" : "Null data or whitespace in field",
    "2004" : "Date with greater than 4 digit year.",
    "2010" : "Business Rule violation - PIN (A-34) can only be used if the file the record is in is addressed to E-Response in the SOAP header, otherwise must be null.",
    "2011" : "Business Rule violation - ClaimEffectiveDate (A-2) Must be equal to or more recent than the request date minus six years and no more than request date plus two years.",
    "2012" : "Business Rule violation - BenefitYearBeginDate (A-9) Must be equal to or more recent than the request date minus six years and no more than request date plus two years.",
    "2013" : "Business Rule violation - RequestDate (A-29) must be greater than or equal to the current date minus one day and not more than the current date plus 6 months in the future.  (State and Broker rule only)",
    "2014" : "Business Rule violation - ResponseDueDate (A-30) must be at least XX days and cannot be more than 24 days after the RequestDate (A-29).",
    "2015" : "Business Rule violation - ClaimantReportedFirstDayofWork (A-20) must be in the past and more recent than the request date minus one hundred years.",
    "2016" : "Business Rule violation - ClaimantReportedLastDayofWork (A-21) must be equal to or after ClaimantReportedFirstDayofWork (A-20).",
    "2017" : "Business Rule violation - ClaimantReportedLastDayofWork (A-21) must be more recent than the request date minus 3 years and not more than the request date plus one year in the future.",
    "2018" : "Business Rule violation - ReturntoWorkDate (A-27) must be after ClaimEffectiveDate (A-2) and not more than the request date plus one year in the future.",
    "2019" : "Business Rule violation - WagesNeededBeginDate (A-23) required if WagesWeeksNeededCode (A-22) is WW or WO.",
    "2020" : "Business Rule violation - WagesNeededBeginDate (A-23) must be in the past and more recent than the request date minus 18 months.",
    "2021" : "Business Rule violation - WagesNeededBeginDate (A-23) must be null if WagesWeeksNeededCode (A-22) is NA.",
    "2022" : "Business Rule violation - WagesNeededEndDate (A-24) required if WagesNeededBeginDate (A-23) is completed.",
    "2023" : "Business Rule violation - WagesNeededEndDate (A-24) must  be in the past and more recent than the WagesNeededBeginDate (A-23).",
    "2024" : "Business Rule violation - WagesNeededEndDate (A-24) must be null if no value in WagesNeededBeginDate (A-23).",
    "2025" : "Business Rule violation - WagesNeededEndDate (A-24) must be null if WagesWeeksNeededCode (A-22) is NA.",
    "2101" : "XSD validation violation.",
    "2102" : "Business Rule violation - Two or more UniqueAttachmentIDs assigned to a specific Separation Information Response are the same - they must be unique.",
    "2103" : "Null data or whitespace in field",
    "2104" : "Date with greater than 4 digit year.",
    "2110" : "Business Rule violation - There is no matching Claim Request record with fields matching the backfilled fields, the StateRequestRecordGUID, and the BrokerRecordTransactionNumber.",
    "2111" : "Business Rule violation - AmendedResponseDescription (B-64) required when AmendedResponse (B-63) is not null.",
    "2112" : "Business Rule violation - AmendedResponseDescription (B-64) must be null if required or optional conditions are not met.",
    "2113" : "Business Rule violation - OtherSSN (B-8) does not equal SSN (B-1) used for claim.",
    "2114" : "Business Rule violation - FraudReasons (B-216) required if FraudInd (B-225) is Y for Yes.",
    "2115" : "Business Rule violation - FraudReasons (B-216) must be null if required or optional conditions are not met.",
    "2116" : "Business Rule violation - FraudComments (B-217) required if FraudReasons (B-245) is 5 for Not listed above.",
    "2117" : "Business Rule violation - FraudComments (B-217) must be null if required or optional conditions are not met.",
    "2118" : "Business Rule violation - EmployerSepReasonCode (B-20) - if PreparerTypeCode (B-52) is E for Employer, then valid codes are 1-20, 23 or 99. ",
    "2119" : "Business Rule violation - EmployerSepReasonCode (B-20) - if PreparerTypeCode (B-52) is T = Third Party Administrator then valid codes are 1-23 or 99.  ",
    "2120" : "Business Rule violation - EmployerSepReasonCode (B-20) required unless RelationshipEndedInd (B-195) is N for No.",
    "2121" : "Business Rule violation - EmployerSepReasonCode (B-20) must be null if required or optional conditions are not met.",
    "2122" : "Business Rule violation - EmployerSepReasonCode (B-20) limited to 9,10,11,or 12 if FraudReasons (B-216) is 2 for Claimant Still Working.",
    "2123" : "Business Rule violation - EmployerReportedClaimantFirstDayofWork (B-12) must be before or equal to EmployerReportedClaimantLastDayofWork (B-13).",
    "2124" : "Business Rule violation - EmployerReportedClaimantFirstDayofWork (B-12) must be in the past and more recent than the RequestDate (B-70) minus one hundred years.",
    "2125" : "Business Rule violation -  EmployerReportedClaimantLastDayofWork (B-13) required if EmployerSepReasonCode (B-20) does not equal 8, 20, 21, 23 or 99 or if EmployerSepReasonCode (B-20) equals 8 and WhyNotReturning (B-166) does not equal 99.",
    "2126" : "Business Rule violation - EmployerReportedClaimantLastDayofWork (B-13) must be after or equal to EmployerReportedClaimantFirstDayofWork (B-12) and not more than the current date.",
    "2127" : "Business Rule violation - EmployerReportedClaimantLastDayofWork (B-13) - if EmployerReportedClaimantFirstDayofWork (B-12) is not provided,  EmployerReportedClaimantLastDayofWork (B-13) must not be more than ten years prior to the request date and cannot be greater than the current date.",
    "2128" : "Business Rule violation - EmployerReportedClaimantLastDayofWork (B-13) must be null if required or optional conditions are not met.",
    "2129" : "Business Rule violation - SeparationDateInd (B-226) required if EmployerSepReasonCode (B-20) is 2, 3, 5, 6, 14, 15, 18, 19 or EmployerSepReasonCode (B-20) is 8 and WhyNotReturning (B-166) is not 16 or 99.",
    "2130" : "Business Rule violation - SeparationDateInd (B-226) must be null if required or optional conditions are not met.",
    "2131" : "Business Rule violation - EffectiveSeparationDate (B-14) required if SeparationDateInd (B-226) is N for No.",
    "2132" : "Business Rule violation - EffectiveSeparationDate (B-14)  must be after EmployerReportedClaimantLastDayofWork (B-13) and not more than RequestDate (B-70) plus 1 year.",
    "2133" : "Business Rule violation - EffectiveSeparationDate (B-14) must be null if required or optional conditions are not met.",
    "2134" : "Business Rule violation - ReturnToWorkInd (B-21) required if EmployerSepReasonCode (B-20) equals 4 for Vacation/Holiday Shutdown . ",
    "2135" : "Business Rule violation - ReturnToWorkInd (B-21) must be null if required or optional conditions are not met.",
    "2136" : "Business Rule violation - ReturnToWorkDateInd (B-135) required if EmployerSepReasonCode (B-20) is 1 for Temporary Layoff.",
    "2137" : "Business Rule violation - ReturnToWorkDateInd (B-135) required if B-21 is Y for Yes.",
    "2138" : "Business Rule violation - ReturnToWorkDateInd (B-135) must be null if required or optional conditions are not met.",
    "2139" : "Business Rule violation - WhyLeaveOfAbsence (B-168) required if EmployerSepReasonCode (B-20) is 13 for Leave of Absence.",
    "2140" : "Business Rule violation - WhyLeaveOfAbsence (B-168) must be null if required or optional conditions are not met.",
    "2141" : "Business Rule violation - AgreedReturnToWorkDateInd (B-169) required if EmployerSepReasonCode (B-20) is 13 for Leave of Absence.",
    "2142" : "Business Rule violation - AgreedReturnToWorkDateInd (B-169) must be null if required or optional conditions are not met.",
    "2143" : "Deprecated",
    "2144" : "Business Rule violation - ReturnToWorkDate (B-22) required if ReturnToWorkDateInd (B-135) is Y for Yes.",
    "2145" : "Business Rule violation - ReturnToWorkDate (B-22) must be after ClaimEffectiveDate (B-2). ",
    "2146" : "Business Rule violation - ReturnToWorkDate (B-22) must be after EffectiveSeparationDate (B-14) or if EffectiveSeparationDate (B-14) is null, must be after EmployerReportedClaimantLastDayofWork (B-13).",
    "2147" : "Business Rule violation - ReturnToWorkDate (B-22) must not be more than request date plus one year in the future.",
    "2148" : "Business Rule violation - ReturnToWorkDate (B-22) required if AgreedReturnToWorkDateInd (B-169) is Y for Yes.",
    "2149" : "Business Rule violation - ReturnToWorkDate (B-22) must be null if required or optional conditions are not met.",
    "2150" : "Business Rule violation - WhoReducedHours (B-167) required if EmployerSepReasonCode (B-20) is 11 for Still Employed, Hours Reduced.",
    "2151" : "Business Rule violation - WhoReducedHours (B-167) must be null if required or optional conditions are not met.",
    "2152" : "Business Rule violation - WorkingAllAvailableHoursInd (B-23) required if EmployerSepReasonCode (B-20) is 10 for Still Employed Part Time, 11 for Still Employed, Hours Reduced, 12 for On Call or Temporary Status.",
    "2153" : "Business Rule violation - WorkingAllAvailableHoursInd (B-23) must be null if required or optional conditions are not met.",
    "2154" : "Business Rule violation - NotWorkingAvailableHoursReason (B-24) required if WorkingAllAvailableHoursInd (B-23) is N for No.",
    "2155" : "Business Rule violation - NotWorkingAvailableHoursReason (B-24) required if EmployerSepReasonCode (B-20) is 18 for Disaster Related.",
    "2156" : "Business Rule violation - NotWorkingAvailableHoursReason (B-24) must be null if required or optional conditions are not met.",
    "2157" : "Business Rule violation - DischargeReasonCode (B-34) required if EmployerSepReasonCode (B-20) is 3 for Discharged, 5 for Asked to Resign, or 15 Suspension.",
    "2158" : "Business Rule violation - DischargeReasonCode (B-34) required if EmployerSepReasonCode (B-20) is 6 for Voluntary Quit/Separation and VoluntarySepReasonCode (B-44) is 5 for In Lieu of Discharge and if InLieuInd (B-185) is Y for Yes.",
    "2159" : "Business Rule violation - DischargeReasonCode (B-34) must be null if required or optional conditions are not met.",
    "2160" : "Business Rule violation - PaidDuringSuspensionInd (B-170) required if EmployerSepReasonCode (B-20) is 15 for Suspension.",
    "2161" : "Business Rule violation - PaidDuringSuspensionInd (B-170) must be null if required or optional conditions are not met.",
    "2162" : "Business Rule violation - ReceiveNormalRateOfPayInd (B-171) required if PaidDuringSuspensionInd (B-170) is Y for Yes.",
    "2163" : "Business Rule violation - ReceiveNormalRateOfPayInd (B-171) must be null if required or optional conditions are not met.",
    "2164" : "Business Rule violation - InadequatePerfReasonInd (B-136) required if DischargeReasonCode (B-34) is 1 for Not Qualified/Inadequate Performance.",
    "2165" : "Business Rule violation - InadequatePerfReasonInd (B-136) must be null if required or optional conditions are not met.",
    "2166" : "Business Rule violation - FinalIncidentDate (B-36) required if DischargeReasonCode (B-34) is 1-5 or 7-13.",
    "2167" : "Business Rule violation - FinalIncidentDate (B-36) must be in the past, prior or equal to the RequestDate (B-70) and after RequestDate (B-70) minus seven years.",
    "2168" : "Business Rule violation - FinalIncidentDate (B-36) must be null if required or optional conditions are not met.",
    "2169" : "Business Rule violation - FinalIncidentReason (B-35) required if DischargeReasonCode (B-34) is 1-5 or 7-13.",
    "2170" : "Business Rule violation - FinalIncidentReason (B-35) must be null if required or optional conditions are not met.",
    "2171" : "Business Rule violation - MetPastExpections (B-137) required if DischargeReasonCode (B-34) is 1 for Not Qualified/Inadequate Performance.  ",
    "2172" : "Business Rule violation - MetPastExpections (B-137) must be null if required or optional conditions are not met.",
    "2173" : "Business Rule violation - ReasonForFinalAbsence (B-140) required if DischargeReasonCode (B-34) is 2 for Absenteeism/Tardiness.",
    "2174" : "Business Rule violation - ReasonForFinalAbsence (B-140) must be null if required or optional conditions are not met.",
    "2175" : "Business Rule violation - AskedToTestInd (B-141) required if DischargeReasonCode (B-34) is 4 for Drugs or 9 for Alcohol.",
    "2176" : "Business Rule violation - AskedToTestInd (B-141) must be null if required or optional conditions are not met.",
    "2177" : "Business Rule violation - TestPerformedInd (B-142) required if AskedToTestInd (B-141) is Y for Yes.",
    "2178" : "Business Rule violation - TestPerformedInd (B-142) must be null if required or optional conditions are not met.",
    "2179" : "Business Rule violation - WhyNotPerformed (B-143) required if TestPerformedInd (B-142) is N for No.",
    "2180" : "Business Rule violation - WhyNotPerformed (B-143) must be null if required or optional conditions are not met.",
    "2181" : "Business Rule violation - WhyRequestedToTest (B-144) required if AskedToTestInd (B-141) is Y for Yes.",
    "2182" : "Business Rule violation - WhyRequestedToTest (B-144) must be null if required or optional conditions are not met.",
    "2183" : "Business Rule violation - WhoPerformedTest (B-145) must be null if required or optional conditions are not met.",
    "2184" : "Business Rule violation - TesterName (B-146) must be null if required or optional conditions are not met.",
    "2185" : "Business Rule violation - TesterCompanyName (B-147) must be null if required or optional conditions are not met.",
    "2186" : "Business Rule violation - TestResults (B-148) must be null if required or optional conditions are not met.",
    "2187" : "Business Rule violation - ChainOfCustodyInd (B-149) must be null if required or optional conditions are not met.",
    "2188" : "Business Rule violation - SecondTestSplitSampleGiven (B-150) must be null if required or optional conditions are not met.",
    "2189" : "Business Rule violation - SecondTestSplitSampleResults (B-151) must be null if required or optional conditions are not met.",
    "2190" : "Business Rule violation - JobChangeInd (B-138) required if MetPastExpectations (B-137) is Y for Yes.",
    "2191" : "Business Rule violation - JobChangeInd (B-138) must be null if required or optional conditions are not met.",
    "2192" : "Business Rule violation - WhatConditionsChanged (B-139) required if JobChangeInd (B-138) is Y for Yes.",
    "2193" : "Business Rule violation - WhatConditionsChanged (B-139) must be null if required or optional conditions are not met.",
    "2194" : "Business Rule violation - WhatWasStolen (B-221) required if DischargeReasonCode (B-34) is 10 for Theft.  ",
    "2195" : "Business Rule violation - WhatWasStolen (B-221) must be null if required or optional conditions are not met.",
    "2196" : "Business Rule violation - ActCommittedViolatedLaw (B-160) required if DischargeReasonCode (B-34) is 11 for Felony/Misdemeanor, Violation of Law, Criminal, Illegal Acts.",
    "2197" : "Business Rule violation - ActCommittedViolatedLaw (B-160) must be null if required or optional conditions are not met.",
    "2198" : "Business Rule violation - AdverseEffectOnEmployer (B-152) required if DischargeReasonCode (B-34) is 5 for Dishonesty, 10 for Theft, or 11 for Felony/Misdemeanor, Violation of Law, Criminal, Illegal Acts.",
    "2199" : "Business Rule violation - AdverseEffectOnEmployer (B-152) must be null if required or optional conditions are not met.",
    "2200" : "Business Rule violation - ValueAttachedToActInd (B-153) required if DischargeReasonCode is 10 for Theft.",
    "2201" : "Business Rule violation - ValueAttachedToActInd (B-153) must be null if required or optional conditions are not met.",
    "2202" : "Business Rule violation - DollarValue (B-154) required if ValueAttachedToActInd (B-153) is Y for Yes. ",
    "2203" : "Business Rule violation - DollarValue (B-154) must be null if required or optional conditions are not met.",
    "2204" : "Business Rule violation - ClaimantAdmissionInd (B-155) required if DischargeReasonCode (B-34) is 10 for Theft or 12 for Property Damage.",
    "2205" : "Business Rule violation - ClaimantAdmissionInd (B-155) must be null if required or optional conditions are not met.",
    "2206" : "Business Rule violation - EmployerDamage (B-156) required if ClaimantAdmissionInd (B-155) is N for No.",
    "2207" : "Business Rule violation - EmployerDamage (B-156) must be null if required or optional conditions are not met.",
    "2208" : "Business Rule violation - DamagesReportedBy (B-161) required if DischargeReasonCode (B-34) is 12 for Property Damage.",
    "2209" : "Business Rule violation - DamagesReportedBy (B-161) must be null if required or optional conditions are not met.",
    "2210" : "Business Rule violation - AltercationOnCompanyPropertyInd (B-162) required if DischargeReasonCode (B-34) is 13 for Physical/Verbal Altercation.",
    "2211" : "Business Rule violation - AltercationOnCompanyPropertyInd (B-162) must be null if required or optional conditions are not met.",
    "2212" : "Business Rule violation - AltercationOnCompanyTimeInd (B-163) required if DischargeReasonCode (B-34) is 13 for Physical/Verbal Altercation.",
    "2213" : "Business Rule violation - AltercationOnCompanyTimeInd (B-163) must be null if required or optional conditions are not met.",
    "2214" : "Business Rule violation - ClaimantStartAltercationInd (B-164) required if DischargeReasonCode (B-34) is 13 for Physical/Verbal Altercation.",
    "2215" : "Business Rule violation - ClaimantStartAltercationInd (B-164) must be null if required or optional conditions are not met.",
    "2216" : "Business Rule violation - ClaimantAvoidAltercationInd (B-165) required if DischargeReasonCode (B-34) is 13 for Physical/Verbal Altercation.",
    "2217" : "Business Rule violation - ClaimantAvoidAltercationInd (B-165) must be null if required or optional conditions are not met.",
    "2218" : "Business Rule violation - WereThereWitnessesInd (B-157) required if DischargeReasonCode (B-34) is 10 for Theft, 12 for Property Damage or 13 for Physical/Verbal Altercation.",
    "2219" : "Business Rule violation - WereThereWitnessesInd (B-157) must be null if required or optional conditions are not met.",
    "2220" : "Business Rule violation - WitnessInformation (B-158) must be included if WereThereWitnessesInd (B-157) is Y for Yes.",
    "2221" : "Business Rule violation - WitnessInformation (B-158) must be null if required or optional conditions are not met.",
    "2222" : "Business Rule violation - ViolateCompanyPolicyInd (B-37) required if DischargeReasonCode (B-34) is 3, 4 or 9.",
    "2223" : "Business Rule violation - ViolateCompanyPolicyInd (B-37) must be null if required or optional conditions are not met.",
    "2224" : "Business Rule violation - DischargePolicyAwareInd (B-38) required if ViolateCompanyPolicyInd (B-37) is Y for Yes.",
    "2225" : "Business Rule violation - DischargePolicyAwareInd (B-38) must be null if required or optional conditions are not met.",
    "2226" : "Business Rule violation - DischargePolicyAwareExplanationCode (B-39) required if DischargePolicyAwareInd (B-38) =is Y for Yes.",
    "2227" : "Business Rule violation - DischargePolicyAwareExplanationCode (B-39) must be null if required or optional conditions are not met.",
    "2228" : "Business Rule violation - WhoDischargedName (B-41) required if DischargeReasonCode (B-34) is 1-13.",
    "2229" : "Business Rule violation - WhoDischargedName (B-41) must be null if required or optional conditions are not met.",
    "2230" : "Business Rule violation - WhoDischargedTitle (B-42) required if DischargeReasonCode (B-34) is 1-13.",
    "2231" : "Business Rule violation - WhoDischargedTitle (B-42) must be null if required or optional conditions are not met.",
    "2232" : "Business Rule violation - DischargeReasonComments (B-43) must be null if required or optional conditions are not met.",
    "2233" : "Business Rule violation - PriorIncidentInd (B-94) required if EmployerSepReasonCode (B-20) is 3 for Discharged, 5 for Asked to Resign, or 15 for Suspension.",
    "2234" : "Business Rule violation - PriorIncidentInd (B-94) required if EmployerSepReasonCode (B-20) is 6 for Voluntary Quit/Separation and VoluntarySepReasonCode (B-44) for 5 for In Lieu of Discharge and InLieuInd (B-195) is Y for Yes.",
    "2235" : "Business Rule violation - PriorIncidentInd (B-94) must be null if required or optional conditions are not met.",
    "2236" : "Business Rule violation - PriorIncident (B-40) - there must be at least one prior incident if PriorIncidentInd (B-94) is Y for Yes.",
    "2237" : "Business Rule violation - PriorIncident (B-40) must be null if required or optional conditions are not met.",
    "2238" : "Business Rule violation - PriorIncidentDate (B-40.1) must be in the past.  ",
    "2239" : "Business Rule violation - PriorIncidentDate (B-40.1) must be prior to Final Incident Date (B-36). ",
    "2240" : "Business Rule violation - PriorIncidentDate (B-40.1) must be equal to or more recent than RequestDate (B-70) minus seven years.",
    "2241" : "Business Rule violation - PriorIncidentWarningDate  (B-40.4) required if PriorIncidentWarningInd (B-40.3) is Y for Yes.",
    "2242" : "Business Rule violation - PriorIncidentWarningDate (B-40.4) must be more recent than or equal to Prior Incident Date (B-40.1) and prior to the RequestDate (B-70).",
    "2243" : "Business Rule violation - PriorIncidentWarningDate (B-40.4) must be null if required or optional conditions are not met.",
    "2244" : "Business Rule violation - PriorIncidentWarningDescription (B-40.5) required if PriorIncidentWarningInd (B-40.3) is Y for Yes.",
    "2245" : "Business Rule violation - PriorIncidentWarningDescription (B-40.5) must be null if required or optional conditions are not met.",
    "2246" : "Business Rule violation - VoluntarySepReasonCode (B-44) required if EmployerSepReasonCode (B-20) is 6 for Voluntary Quit.",
    "2247" : "Business Rule violation - VoluntarySepReasonCode (B-44) must be null if required or optional conditions are not met.",
    "2248" : "Business Rule violation - ClaimantNotifyOfMedicalIssue (B-102) required if VoluntarySepReasonCode (B-44) is 3 for Health Reasons.",
    "2249" : "Business Rule violation - ClaimantNotifyOfMedicalIssue (B-102) must be null if required or optional conditions are not met.",
    "2250" : "Business Rule violation - ClaimantRequestMedicalLOA (B-103) required if VoluntarySepReasonCode (B-44) is 3 for Health Reasons.",
    "2251" : "Business Rule violation - ClaimantRequestMedicalLOA (B-103) must be null if required or optional conditions are not met.",
    "2252" : "Business Rule violation - MedicalLOAAvailable (B-104) required if ClaimantRequestMedicalLOA (B-103) is N for No.",
    "2253" : "Business Rule violation - MedicalLOAAvailable (B-104) must be null if required or optional conditions are not met.",
    "2254" : "Business Rule violation - LOAApprovedInd (B-105) required if ClaimantRequestMedicalLOA (B-103)  is Y for Yes.",
    "2255" : "Business Rule violation - LOAApprovedInd (B-105) must be null if required or optional conditions are not met.",
    "2256" : "Business Rule violation - WhyLOADenied (B-106) required if LOAApprovedInd (B-105) is N for No.",
    "2257" : "Business Rule violation - WhyLOADenied (B-106) must be null if required or optional conditions are not met.",
    "2258" : "Business Rule violation - QuitUnderAdviceOfHealthcareProvider (B-107) required if VoluntarySepReasonCode (B-44) is 3 for Health Reasons.",
    "2259" : "Business Rule violation - QuitUnderAdviceOfHealthcareProvider (B-107) must be null if required or optional conditions are not met.",
    "2260" : "Business Rule violation - MedicalStatementProvidedInd (B-108) required if QuitUnderAdviceOfHealthcareProvider (B-107) is Y for Yes.",
    "2261" : "Business Rule violation - MedicalStatementProvidedInd (B-108) must be null if required or optional conditions are not met.",
    "2262" : "Business Rule violation - DutiesClaimantCouldNotPerform (B-109) required if VoluntarySepReasonCode (B-44) is 3 for Health Reasons.",
    "2263" : "Business Rule violation - DutiesClaimantCouldNotPerform (B-109) must be null if required or optional conditions are not met.",
    "2264" : "Business Rule violation - WorkRestrictionsInd (B-110) required if VoluntarySepReasonCode (B-44) is 3 for Health Reasons.",
    "2265" : "Business Rule violation - WorkRestrictionsInd (B-110) required if ReceivingWorkersCompensation (B-201) is Y for Yes.",
    "2266" : "Business Rule violation - WorkRestrictionsInd (B-110) must be null if required or optional conditions are not met.",
    "2267" : "Business Rule violation - ClaimantWorkRestrictions (B-111) required if WorkRestrictionsInd (B-110) is Y for Yes.",
    "2268" : "Business Rule violation - ClaimantWorkRestrictions (B-111) must be null if required or optional conditions are not met.",
    "2269" : "Business Rule violation - WorkAvailableWithinRestrictionsInd (B-112) required if VoluntarySepReasonCode (B-44) is 3 for Health Reasons and WorkRestrictionsInd (B-110) is Y for Yes.",
    "2270" : "Business Rule violation - WorkAvailableWithinRestrictionsInd (B-112) must be null if required or optional conditions are not met.",
    "2271" : "Business Rule violation - OtherWorkOfferedInd (B-113) required if WorkAvailableWithinRestrictionsInd (B-112) is Y for Yes.",
    "2272" : "Business Rule violation - OtherWorkOfferedInd (B-113)must be null if required or optional conditions are not met.",
    "2273" : "Business Rule violation - InLieuInd (B-185) required if VoluntarySepReasonCode (B-44) is 5 for In Lieu of Discharge.",
    "2274" : "Business Rule violation - InLieuInd (B-185) must be null if required or optional conditions are not met.",
    "2275" : "Business Rule violation - FailedToReport (B-115) required if VoluntarySepReasonCode (B-44) is 7 for Failure to Report to Work/Job Abandonment. ",
    "2276" : "Business Rule violation - FailedToReport (B-115) must be null if required or optional conditions are not met.",
    "2277" : "Business Rule violation - DateFailedToReport (B-115.1) sequence number ${sequencenumber} required if DateFailedtoReportUnknown (115.2) is null.",
    "2278" : "Business Rule violation - DateFailedToReport (B-115.1) must be null if required or optional conditions are not met.",
    "2279" : "Business Rule violation - DateFailedtoReportUnknown (B-115.2) sequence number ${sequencenumber} required if DateFailedToReport is null.",
    "2280" : "Business Rule violation - DateFailedtoReportUnknown (B-115.2) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2281" : "Business Rule violation - ContinuingWorkAvailableInd (B-49) required if VoluntarySepReasonCode (B-44) is 1, 2, 4, 6 - 10.",
    "2282" : "Business Rule violation - ContinuingWorkAvailableInd (B-49) required if MandatoryRetirementInd (B-28) is N for No.",
    "2283" : "Business Rule violation - ContinuingWorkAvailableInd (B-49) must be null if required or optional conditions are not met.",
    "2284" : "Business Rule violation - ReasonDissatisfied (B-114) required if VoluntarySepReasonCode (B-44) is 4 for Job Dissatisfaction.",
    "2285" : "Business Rule violation - ReasonDissatisfied (B-114) must be null if required or optional conditions are not met.",
    "2286" : "Business Rule violation - WorkingConditions (B-119) required if VoluntarySepReasonCode (B-44) is 9 for Working Conditions.",
    "2287" : "Business Rule violation - WorkingConditions (B-119) must be null if required or optional conditions are not met.",
    "2288" : "Business Rule violation - WorkingConditionsChangedInd (B-120) required if VoluntarySepReasonCode (B-44) is 9 for Working Conditions.",
    "2289" : "Business Rule violation - WorkingConditionsChangedInd (B-120) must be null if required or optional conditions are not met.",
    "2290" : "Business Rule violation - ChangesPermanentInd (B-121) required if WorkingConditionsChangedInd (B-120 is Y for Yes.",
    "2291" : "Business Rule violation - ChangesPermanentInd (B-121) must be null if required or optional conditions are not met.",
    "2292" : "Business Rule violation - ChangesScheduledToLast (B-122) required if ChangesPermanentInd (B-121) is N for No.",
    "2293" : "Business Rule violation - ChangesScheduledToLast (B-122) must be null if required or optional conditions are not met.",
    "2294" : "Business Rule violation - MandatoryRetirementInd (B-28) required if EmployerSepReasonCode (B-20) is 14 for Retirement.",
    "2295" : "Business Rule violation - MandatoryRetirementInd (B-28) must be null if required or optional conditions are not met.",
    "2296" : "Business Rule violation - WhyRetireComments (B-132) required if EmployerSepReasonCode (B-20) is 14 for Retirement.",
    "2297" : "Business Rule violation - WhyRetireComments (B-132) must be null if required or optional conditions are not met.",
    "2298" : "Business Rule violation - HiringAgreementChangesCode (B-45) required if VoluntarySepReasonCode (B-44) is 1-4, 6,  10.",
    "2299" : "Business Rule violation - HiringAgreementChangesCode (B-45) must be null if required or optional conditions are not met.",
    "2300" : "Business Rule violation - HiringAgreementChangesComments (B-46) required if HiringAgreementChangesCode (B-45) is 2-6.",
    "2301" : "Business Rule violation - HiringAgreementChangesComments (B-46) must be null if required or optional conditions are not met.",
    "2302" : "Business Rule violation - EffectiveDateOfChanges (B-95) required if HiringAgreementChangesCode (B-45) is 2-6.",
    "2303" : "Business Rule violation - EffectiveDateOfChanges (B-95) must be prior to the ClaimEffectiveDate (B-2) and more recent than the request date minus one hundred years.",
    "2304" : "Business Rule violation - EffectiveDateOfChanges (B-95) must be null if required or optional conditions are not met.",
    "2305" : "Business Rule violation - ClaimantActionstoAvoidQuitInd (B-47) required if VoluntarySepReasonCode (B-44) is 1-4, 6-7, 9, 10.",
    "2306" : "Business Rule violation - ClaimantActionstoAvoidQuitInd (B-47) must be null if required or optional conditions are not met.",
    "2307" : "Business Rule violation - ActionTakenComments (B-48) required if ClaimantActionstoAvoidQuitInd (B-47) = Y for Yes.",
    "2308" : "Business Rule violation - ActionTakenComments (B-48) must be null if required or optional conditions are not met.",
    "2309" : "Business Rule violation - ClaimantContactToExplainInd (B-116) required if VoluntarySepReasonCode (B-44) is 7 for Failure to Report to Work/Job Abandonment.",
    "2310" : "Business Rule violation - ClaimantContactToExplainInd (B-116) must be null if required or optional conditions are not met.",
    "2311" : "Business Rule violation - DateMadeContact (B-117) required if ClaimantContactToExplainInd (B-116) is Y for Yes.",
    "2312" : "Business Rule violation - DateMadeContact (B-117) must be null if required or optional conditions are not met.",
    "2313" : "Business Rule violation - ReasonForFailToReport (B-118) required if ClaimantContactToExplainInd (B-116) is Y for Yes.",
    "2314" : "Business Rule violation - ReasonForFailToReport (B-118) must be null if required or optional conditions are not met.",
    "2315" : "Business Rule violation - ClaimantNoticeInd (B-96) required if VoluntarySepReasonCode (B-44) is 1-4, 6, 9, 10.",
    "2316" : "Business Rule violation - ClaimantNoticeInd (B-96) must be null if required or optional conditions are not met.",
    "2317" : "Business Rule violation - DateNoticeGiven (B-97) required if ClaimantNoticeInd (B-96) is Y for Yes and DateNoticeGivenUnknown (B-159) is null.",
    "2318" : "Business Rule violation - DateNoticeGiven (B-97) must be prior to ClaimEffectiveDate (B-2) and more recent than the request date minus one hundred years.",
    "2319" : "Business Rule violation - DateNoticeGiven (B-97) must be null if required or optional conditions are not met.",
    "2320" : "Business Rule violation - DateNoticeGivenUnknown (B-159) required if ClaimantNoticeInd (B-96) is Y for Yes and DateNoticeGiven (B-97) is null.",
    "2321" : "Business Rule violation - DateNoticeGivenUnknown (B-159) must be null if required or optional conditions are not met.",
    "2322" : "Business Rule violation - ClaimantProvidedIntendedLastDayWork (B-98) required if ClaimantNoticeInd (B-96) is Y for Yes and ClaimantProvidedIntendedLastDayWorkUnknown (B-187) is null.",
    "2323" : "Business Rule violation - ClaimantProvidedIntendedLastDayWork (B-98) must be null if required or optional conditions are not met.",
    "2324" : "Business Rule violation - ClaimantProvidedIntendedLastDayWorkUnknown (B-187) required if ClaimantNoticeInd (B-96) is Y for Yes and ClaimantProvidedIntendedLastDayWork (B-98) is null.",
    "2325" : "Business Rule violation - ClaimantProvidedIntendedLastDayWorkUnknown (B-187) must be null if required or optional conditions are not met.",
    "2326" : "Business Rule violation - ClaimantWorkOutNoticeInd (B-99) required if ClaimantNoticeInd (B-96) is Y for Yes.",
    "2327" : "Business Rule violation - ClaimantWorkOutNoticeInd (B-99) must be null if required or optional conditions are not met.",
    "2328" : "Business Rule violation - WhyNoticeWasntWorkedOut (B-100) required if ClaimantWorkOutNoticeInd (B-99) is N for No.",
    "2329" : "Business Rule violation - WhyNoticeWasntWorkedOut (B-100) must be null if required or optional conditions are not met.",
    "2330" : "Business Rule violation - ClaimantPaidThroughNoticeInd (B-101) required if ClaimantWorkOutNoticeInd (B-99) is N for No.",
    "2331" : "Business Rule violation - ClaimantPaidThroughNoticeInd (B-101) must be null if required or optional conditions are not met.",
    "2332" : "Business Rule violation - VoluntarySepReasonComments (B-50) required if VoluntarySepReasonCode (B-44) is 10 for Not Listed Above.",
    "2333" : "Business Rule violation - VoluntarySepReasonComments (B-50) must be null if required or optional conditions are not met.",
    "2334" : "Business Rule violation - WhyNotReturning (B-166) required if EmployerSepReasonCode (B-20) is 8 for Educational Institution Employee, Between Terms or Semesters, Not Likely to Return.",
    "2335" : "Business Rule violation - WhyNotReturning (B-166) must be null if required or optional conditions are not met.",
    "2336" : "Business Rule violation - FirstDayOfContract (B-183) required if EmployerSepReasonCode is 17 for Professional Athlete.",
    "2337" : "Business Rule violation - FirstDayOfContract (B-183) must be null if required or optional conditions are not met.",
    "2338" : "Business Rule violation - LastDayOfContract (B-184) required if EmployerSepReasonCode is 17 for Professional Athlete.",
    "2339" : "Business Rule violation - LastDayOfContract (B-184) must be equal to or after FirstDayofContract (B-183) and not more than the request date plus ten years in the future.",
    "2340" : "Business Rule violation - LastDayOfContract (B-184) must be null if required or optional conditions are not met.",
    "2341" : "Business Rule violation - ReasonForBreak (B-123) required if EmployerSepReasonCode (B-20) is 7 for Educational Institution Employee, Between Semesters or Terms, Likely to Return.",
    "2342" : "Business Rule violation - ReasonForBreak (B-123) must be null if required or optional conditions are not met.",
    "2343" : "Business Rule violation - FirstDayOfBreak (B-124) required if EmployerSepReasonCode (B-20) is 7 for Educational Institution Employee, Between Semesters or Terms, Likely to Return.",
    "2344" : "Business Rule violation - FirstDayOfBreak (B-124) must be null if required or optional conditions are not met.",
    "2345" : "Business Rule violation - LastDayOfBreak (B-125) required if EmployerSepReasonCode (B-20) is 7 for Educational Institution Employee, Between Semesters or Terms, Likely to Return.",
    "2346" : "Business Rule violation - LastDayOfBreak (B-125) must be equal to or after FirstDayofBreak (B-124) and not more than the request date plus ten years in the future.",
    "2347" : "Business Rule violation - LastDayOfBreak (B-125) must be null if required or optional conditions are not met.",
    "2348" : "Business Rule violation - WorkContinueDuringBreakInd (B-126) must be null if required or optional conditions are not met.",
    "2349" : "Business Rule violation - PositionReturningTo (B-127) required if EmployerSepReasonCode (B-20) is 7 for Educational Institution Employee, Between Semesters or Terms, Likely to Return.",
    "2350" : "Business Rule violation - PositionReturningTo (B-127) must be null if required or optional conditions are not met.",
    "2351" : "Business Rule violation - NewContractJobOfferInd (B-128) required if EmployerSepReasonCode is 17 for Professional Athlete.",
    "2352" : "Business Rule violation - NewContractJobOfferInd (B-128) must be null if required or optional conditions are not met.",
    "2353" : "Business Rule violation - PersonOfferedReasonableAssurance (B-129) required if NewContractJobOfferInd (B-128) is Y for Yes.",
    "2354" : "Business Rule violation - PersonOfferedReasonableAssurance (B-129) required if NotWorkingOnAssignment (B-197) is 3 for Assignment Completed, Contact Established, Claimant Declined New Assignment.",
    "2355" : "Business Rule violation - PersonOfferedReasonableAssurance (B-129) must be null if required or optional conditions are not met.",
    "2356" : "Business Rule violation - HaveAuthorityToOfferInd (B-130) required if NewContractJobOfferInd (B-128) is Y for Yes.",
    "2357" : "Business Rule violation - HaveAuthorityToOfferInd (B-130) must be null if required or optional conditions are not met.",
    "2358" : "Business Rule violation - HowOfferConveyed (B-131) required if NewContractJobOfferInd (B-128) is Y for Yes.",
    "2359" : "Business Rule violation - HowOfferConveyed (B-131) required if NotWorkingOnAssignment (B-197) is 3 for Assignment Completed, Contact Established, Claimant Declined New Assignment.",
    "2360" : "Business Rule violation - HowOfferConveyed (B-131) must be null if required or optional conditions are not met.",
    "2361" : "Business Rule violation - WhyContractNotOffered (B-133) required if NewContractJobOfferInd (B-128) is N for No.",
    "2362" : "Business Rule violation - WhyContractNotOffered (B-133) must be null if required or optional conditions are not met.",
    "2363" : "Business Rule violation - ContractAccepted (B-134) must be null if required or optional conditions are not met.",
    "2364" : "Business Rule violation - LaborDisputeTypeInd (B-25) required if EmployerSepReasonCode(B-20) is 16 for Labor Dispute.",
    "2365" : "Business Rule violation - LaborDisputeTypeInd (B-25) must be null if required or optional conditions are not met.",
    "2366" : "Business Rule violation - LocationOfLaborDispute (B-172) must be null if required or optional conditions are not met.",
    "2367" : "Business Rule violation - UnionNameAndLocalNo (B-173) must be null if required or optional conditions are not met.",
    "2368" : "Business Rule violation - DateDisputeBegan (B-174) required if EmployerSepReasonCode (B-20) is 16 for Labor Dispute.",
    "2369" : "Business Rule violation - DateDisputeBegan (B-174) must be null if required or optional conditions are not met.",
    "2370" : "Business Rule violation - LaborDisputeEndedInd ( B-175) required if EmployerSepReasonCode (B-20) is 16 for Labor Dispute.",
    "2371" : "Business Rule violation - LaborDisputeEndedInd ( B-175) must be null if required or optional conditions are not met.",
    "2372" : "Business Rule violation - DateDisputeEnded (B-176) required if LaborDisputeEndedInd (B-175) is Y for Yes.",
    "2373" : "Business Rule violation - DateDisputeEnded (B-176) must be equal to or after DateDisputeBegan (B-174) and not more than the request date plus one year in the future.",
    "2374" : "Business Rule violation - DateDisputeEnded (B-176) must be null if required or optional conditions are not met.",
    "2375" : "Business Rule violation - ReplacementWorkersHiredInd (B-177) required if EmployerSepReasonCode (B-20) is 16 for Labor Dispute.",
    "2376" : "Business Rule violation - ReplacementWorkersHiredInd (B-177) must be null if required or optional conditions are not met.",
    "2377" : "Business Rule violation - ClmtStrikingUnionMemberInd (B-178) required if EmployerSepReasonCode (B-20) is 16 for Labor Dispute.",
    "2378" : "Business Rule violation - ClmtStrikingUnionMemberInd (B-178) must be null if required or optional conditions are not met.",
    "2379" : "Business Rule violation - ClmtMemberAnotherUnionInd (B-179) must be null if required or optional conditions are not met.",
    "2380" : "Business Rule violation - WhyUnemployedLaborDispute (B-180) required if ClmtStrikingUnionMemberInd (B-178) is N for No.",
    "2381" : "Business Rule violation - WhyUnemployedLaborDispute (B-180) must be null if required or optional conditions are not met.",
    "2382" : "Business Rule violation - SettlementAffectClmtInd (B-181) must be null if required or optional conditions are not met.",
    "2383" : "Business Rule violation - HowSettlementAffects (B-182) must be null if required or optional conditions are not met.",
    "2384" : "Business Rule violation - RelationshipEndedInd (B-195) required if TempStaffingInd (B-246) is Y for Yes.",
    "2385" : "Business Rule violation - RelationshipEndedInd (B-195) must be null if required or optional conditions are not met.",
    "2386" : "Business Rule violation - WorkingNewAssignmentInd (B-196) required if RelationshipEnded (B-195) is N for No.",
    "2387" : "Business Rule violation - WorkingNewAssignmentInd (B-196) must be null if required or optional conditions are not met.",
    "2388" : "Business Rule violation - NotWorkingOnAssignment (B-197) required if WorkingNewAssignment (B-196) is N for No.",
    "2389" : "Business Rule violation - NotWorkingOnAssignment (B-197) must be null if required or optional conditions are not met.",
    "2390" : "Business Rule violation - TempAgencyPolicyInd (B-198) required if NotWorkingonAssignment (B-197) is 2 for Assignment Completed, Claimant Failed to Contact or 4 for Assignment Not Completed.",
    "2391" : "Business Rule violation - TempAgencyPolicyInd (B-198) must be null if required or optional conditions are not met.",
    "2392" : "Business Rule violation - TempPolicyAwarenessCode (B-186) required if  TempAgencyPolicyInd (B-198) is Y for Yes.",
    "2393" : "Business Rule violation - TempPolicyAwarenessCode (B-186) must be null if required or optional conditions are not met.",
    "2394" : "Business Rule violation - TempAssignmentLastDay (B-199) required if NotWorkingOnAssignment (B-197) is 2 for Assignment Completed, Claimant Failed to Contact or 4 for Assignment Not Completed.",
    "2395" : "Business Rule violation - TempAssignmentLastDay (B-199) must be null if required or optional conditions are not met.",
    "2396" : "Business Rule violation - PreviousAssignment (B-219) required if NotWorkingOnAssignment (B-197) is 3 for Assignment Completed, Contact Established, Claimant Declined New Assignment.",
    "2397" : "Business Rule violation - PreviousAssignment (B-219) must be null if required or optional conditions are not met.",
    "2398" : "Business Rule violation - PrevTempAssignmentEndDate (B-219.2) sequence number ${sequencenumber} must be equal to or after PrevAssignmentStartDate (B-219.1).",
    "2399" : "Business Rule violation - NewTempAssignmentDateOfferMade (B-220) required if NotWorkingOnAssignment (B-197) is 3 for Assignment Completed, Contact Established, Claimant Declined New Assignment.",
    "2400" : "Business Rule violation - NewTempAssignmentDateOfferMade (B-220) must be null if required or optional conditions are not met.",
    "2401" : "Business Rule violation - NewTempAssignmentStartDate (B-200) required if NotWorkingOnAssignment (B-197) is 3 for Assignment Completed, Contact Established, Claimant Declined New Assignment.",
    "2402" : "Business Rule violation - NewTempAssignmentStartDate (B-200) must be null if required or optional conditions are not met.",
    "2403" : "Business Rule violation - NewTempAssignmentJobDuties (B-232) required if NotWorkingOnAssignment (B-197) is 3 for Assignment Completed, Contact Established, Claimant Declined New Assignment.",
    "2404" : "Business Rule violation - NewTempAssignmentJobDuties (B-232) must be null if required or optional conditions are not met.",
    "2405" : "Business Rule violation - NewTempAssignmentRateOfPay (B-233) required if NotWorkingOnAssignment (B-197) is 3 for Assignment Completed, Contact Established, Claimant Declined New Assignment.",
    "2406" : "Business Rule violation - NewTempAssignmentRateOfPay (B-233) must be null if required or optional conditions are not met.",
    "2407" : "Business Rule violation - NewTempAssignmentCommutingDistance (B-234) required if NotWorkingOnAssignment (B-197) is 3 for Assignment Completed, Contact Established, Claimant Declined New Assignment.",
    "2408" : "Business Rule violation - NewTempAssignmentCommutingDistance (B-234) must be null if required or optional conditions are not met.",
    "2409" : "Business Rule violation - NewTempAssignmentHours (B-235) required if NotWorkingOnAssignment (B-197) is 3 for Assignment Completed, Contact Established, Claimant Declined New Assignment.",
    "2410" : "Business Rule violation - NewTempAssignmentHours (B-235) must be null if required or optional conditions are not met.",
    "2411" : "Business Rule violation - NewTempAssignmentWhyRefused (B-237) required if NotWorkingOnAssignment (B-197) is 3 for Assignment Completed, Contact Established, Claimant Declined New Assignment.",
    "2412" : "Business Rule violation - NewTempAssignmentWhyRefused (B-237) must be null if required or optional conditions are not met.",
    "2413" : "Business Rule violation - NewTempAssignmentDateRefused (B-238) required if NotWorkingOnAssignment (B-197) is 3 for Assignment Completed, Contact Established, Claimant Declined New Assignment.",
    "2414" : "Business Rule violation - NewTempAssignmentDateRefused (B-238) must be null if required or optional conditions are not met.",
    "2415" : "Business Rule violation - TempAssignmentWhoEnded (B-239) required if NotWorkingOnAssignment (B-197) is 4 for Assignment Not Completed.",
    "2416" : "Business Rule violation - TempAssignmentWhoEnded (B-239) must be null if required or optional conditions are not met.",
    "2417" : "Business Rule violation - TempAssignmentWhyNotCompleted (B-240) required if NotWorkingOnAssignment (B-197) is 4 for Assignment Not Completed.",
    "2418" : "Business Rule violation - TempAssignmentWhyNotCompleted (B-240) must be null if required or optional conditions are not met.",
    "2419" : "Business Rule violation - TempAssignmentClaimantContactAgencyInd (B-236) required if NotWorkingOnAssignment (B-197) is 4 for Assignment Not Completed.",
    "2420" : "Business Rule violation - TempAssignmentClaimantContactAgencyInd (B-236) must be null if required or optional conditions are not met.",
    "2421" : "Business Rule violation - TempAssignmentWorkAvailableInd (B-231) required if TempAssignmentClaimantContactAgencyInd (B-236) is N for No.",
    "2422" : "Business Rule violation - TempAssignmentWorkAvailableInd (B-231) must be null if required or optional conditions are not met.",
    "2423" : "Business Rule violation - EmployerSepReasonComments (B-33) required if  ReturnToWorkInd (B-135) is N for No and EmployerSepReasonCode (B-20) is 1.  ",
    "2424" : "Business Rule violation - EmployerSepReasonComments (B-33) required if EmployerSepReasonCode (B-20) is 4 for Vacation/holiday shutdown.",
    "2425" : "Business Rule violation - EmployerSepReasonComments (B-33) required if EmployerSepReasonCode (B-20) is 14 for Retirement and MandatoryRetirementInd (B-28) is N for No.",
    "2426" : "Business Rule violation - EmployerSepReasonComments (B-33) required if EmployerSepReasonCode (B-20) is 9 for Still working full-time or 10 for Still working part-time or 11 for Still employed, hours reduced or 12 for On Call or 13 for Leave of Absence or 19 for Not Listed Above.",
    "2427" : "Business Rule violation - EmployerSepReasonComments (B-33) must be null if required or optional conditions are not met.",
    "2428" : "Business Rule violation - RefuseToProvideInd (B-241) required if EmployerSepReasonCode (B-20) is 99 for Refuse to Provide.",
    "2429" : "Business Rule violation - RefuseToProvideInd (B-241) must be null if required or optional conditions are not met.",
    "2430" : "Business Rule violation - EmployerContactName (B-188) must be null if required or optional conditions are not met.",
    "2431" : "Business Rule violation - EmployerPhone (B-189) must be null if required or optional conditions are not met.",
    "2432" : "Business Rule violation - EmployerStreetAddress (B-190) must be null if required or optional conditions are not met.",
    "2433" : "Business Rule violation - EmployerCity (B-191) must be null if required or optional conditions are not met.",
    "2434" : "Business Rule violation - EmployerState (B-192) must be null if required or optional conditions are not met.",
    "2435" : "Business Rule violation - EmployerZIP (B-193) must be null if required or optional conditions are not met.",
    "2436" : "Business Rule violation - RepContractTermDate (B-194) must be null if required or optional conditions are not met.",
    "2437" : "Business Rule violation - TotalEarnedWagesNeededInd (B-61) required if WagesWeeksNeededCode (A-22) is WO or WW and EmployerSeparationReasonCode (B-20) does not equal 20 or 21 or 23 or is null.",
    "2438" : "Business Rule violation - TotalEarnedWagesNeededInd (B-61) must be null if WagesNeededBeginDate (A-23) and WagesNeededEndDate (A-24) are null.",
    "2439" : "Business Rule violation - TotalEarnedWagesNeededInd (B-61) must be null if required or optional conditions are not met.",
    "2440" : "Business Rule violation - TotalEarnedWages (B-15) required if TotalEarnedWagesNeededInd (B-61) is 1 for Wages are Available. ",
    "2441" : "Business Rule violation - TotalEarnedWages (B-15) must be null if required or optional conditions are not met.",
    "2442" : "Business Rule violation - TotalWeeksWorkedNeededInd (B-62) required if WagesWeeksNeededCode (A-22) is WW and EmployerSeparationReasonCode (B-20) does not equal 20 or 21 or 23 or is null.",
    "2443" : "Business Rule violation - TotalWeeksWorkedNeededInd (B-62) must be null if WagesNeededBeginDate (A-23) and WagesNeededEndDate (A-24) are null.",
    "2444" : "Business Rule violation - TotalWeeksWorkedNeededInd (B-62) must be null if required or optional conditions are not met.",
    "2445" : "Business Rule violation - TotalWeeksWorked (B-16) required if TotalWeeksWorkedNeededInd (B-62) is 1 for Weeks are Available.",
    "2446" : "Business Rule violation - TotalWeeksWorked (B-16) must be null if required or optional conditions are not met.",
    "2447" : "Business Rule violation - NumberOfHoursWorkedAfterClaimEffectiveDate (B-18) must be null if required or optional conditions are not met.",
    "2448" : "Business Rule violation - RegularRateofPay (B-227) required if RemunerationInd (B-74) is Y for Yes or ReceivePension401KInd (B-210) is 1 for Pension or 2 for 401K or 3 for Pension and 401k.",
    "2449" : "Business Rule violation - RegularRateofPay (B-227) must be null if required or optional conditions are not met.",
    "2450" : "Business Rule violation - RateofPayPerPeriod (B-228) required if RemunerationInd (B-74) is Y for Yes or ReceivePension401KInd (B-210) is 1 for Pension or 2 for 401K or 3 for Pension and 401k.",
    "2451" : "Business Rule violation - RateofPayPerPeriod (B-228) must be null if required or optional conditions are not met.",
    "2452" : "Business Rule violation - AverageNumberofHoursWorkedperWeek (B-27) required if RemunerationInd (B-74) is Y for Yes or ReceivePension401KInd (B-210) is 1 for Pension or 2 for 401K or 3 for Pension and 401k.",
    "2453" : "Business Rule violation - AverageNumberofHoursWorkedperWeek (B-27) must be null if required or optional conditions are not met.",
    "2454" : "Business Rule violation - CustomaryWeeklyWorkSchedule (B-229) required if RemunerationInd (B-74) is Y for Yes or ReceivePension401KInd (B-210) is 1 for Pension or 2 for 401K or 3 for Pension and 401k. ",
    "2455" : "Business Rule violation - CustomaryWeeklyWorkSchedule (B-229) must be null if required or optional conditions are not met.",
    "2456" : "Business Rule violation - RemunerationInd (B-74) required unless EmployerSepReasonCode (B-20) is 20, 21, or 23.",
    "2457" : "Business Rule violation - RemunerationInd (B-74) must be null if required or optional conditions are not met.",
    "2458" : "Business Rule violation - Remuneration (B-26) required if RemunerationInd (B-74) is Y for Yes.",
    "2459" : "Business Rule violation - Remuneration (B-26) must be null if required or optional conditions are not met.",
    "2460" : "Business Rule violation - EmployerAllocationInd (B-26.5) sequence number ${sequencenumber} required if AllocationRequiredInd (A-36) is Y for Yes.",
    "2461" : "Business Rule violation - EmployerAllocationInd (B-26.5) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2462" : "Business Rule violation - AllocationBeginDate (B-26.6) sequence number ${sequencenumber} required if EmployerAllocationInd (B-26.5) is Y for Yes and AllocationBeginDateUnknownInd (B-26.91) is null.",
    "2463" : "Business Rule violation - AllocationBeginDate (B-26.6) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2464" : "Business Rule violation - AllocationBeginDateUnknownInd (B-26.91) sequence number ${sequencenumber} required if EmployerAllocationInd (B-26.5) is Y for Yes and AllocationBeginDate (B-26.6) is null.",
    "2465" : "Business Rule violation - AllocationBeginDateUnknownInd (B-26.91) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2466" : "Business Rule violation - AllocationEndDate (B-26.7) sequence number ${sequencenumber} required if EmployerAllocationInd (B-26.5) is Y for Yes and AllocationEndDateUnknownInd (B-26.92) is null.",
    "2467" : "Business Rule violation - AllocationEndDate (B-26.7) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2468" : "Business Rule violation - AllocationEndDateUnknownInd (B-26.92) sequence number ${sequencenumber} required if EmployerAllocationInd (B-26.5) is Y for Yes or AllocationEndDate (B-26.7) is null.",
    "2469" : "Business Rule violation - AllocationEndDateUnknownInd (B-26.92) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2470" : "Business Rule violation - RemunerationAmountPerPeriod (B-26.2) sequence number ${sequencenumber} required if ReumerationPeriodFrequencyCode (B-26.3) is D, W, B, S, M, Q, L.",
    "2471" : "Business Rule violation - RemunerationAmountPerPeriod (B-26.2) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2472" : "Business Rule violation - NumberHoursRepresented (B-26.8) sequence number ${sequencenumber} required if RemunerationTypeCode (B-26.1) is 1-15 and RemunerationPeriodFrequencyCode (B-26.3) is D, W, B, S, M, Q, or L.",
    "2473" : "Business Rule violation - NumberHoursRepresented (B-26.8) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2474" : "Business Rule violation - DateRemunerationIssued (B-26.4) sequence number ${sequencenumber} required if RemunerationTypeCode (B-26.1) is 1-15 and RemunerationPeriodFrequencyCode (B-26.3) is D, W, B, S, M, Q, or L.",
    "2475" : "Business Rule violation - DateRemunerationIssued (B-26.4) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2476" : "Business Rule violation - RemunerationComments (B-26.10) sequence number ${sequencenumber} required if RemunerationTypeCode (B-26.1) is 14. ",
    "2477" : "Business Rule violation - RemunerationComments (B-26.10) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2478" : "Business Rule violation - DateOfInjury (B-202) required if ReceivingWorkersCompensationInd (B-201) is Y for Yes.",
    "2479" : "Business Rule violation - DateOfInjury (B-202) must be null if required or optional conditions are not met.",
    "2480" : "Business Rule violation - DateAppliedForWorkersCompKnownInd (B-203) required if ReceivingWorkersCompensationInd (B-201) is Y for Yes.",
    "2481" : "Business Rule violation - DateAppliedForWorkersCompKnownInd (B-203) must be null if required or optional conditions are not met.",
    "2482" : "Business Rule violation - DateAppliedForWorkersComp (B-204) required if DateAppliedForWorkersCompKnownInd (B-203) is Y for Yes.",
    "2483" : "Business Rule violation - DateAppliedForWorkersComp (B-204) must be null if required or optional conditions are not met.",
    "2484" : "Business Rule violation - TypeOfWorkersCompReceiving (B-205) required if ReceivingWorkersCompensation (B-201) is Y for Yes.",
    "2485" : "Business Rule violation - TypeOfWorkersCompReceiving (B-205) must be null if required or optional conditions are not met.",
    "2486" : "Business Rule violation - WeeklyWorkersCompRate (B-206) must be null if required or optional conditions are not met.",
    "2487" : "Business Rule violation - PeriodOfTimeWorkersCompPaymentCovers (B-207) must be null if required or optional conditions are not met.",
    "2488" : "Business Rule violation - ClaimantReleasedToReturnToWork (B-208) required if ReceivingWorkersCompensationInd (B-201) is Y for Yes.",
    "2489" : "Business Rule violation - ClaimantReleasedToReturnToWork (B-208) must be null if required or optional conditions are not met.",
    "2490" : "Business Rule violation - DateClaimantReleased (B-209) required if ClaimantReleasedToReturnToWork (B-208) is Y for Yes.",
    "2491" : "Business Rule violation - DateClaimantReleased (B-209) must be null if required or optional conditions are not met.",
    "2492" : "Business Rule violation - EmployerAccommodateRestrictionsInd (B-212) must be null if required or optional conditions are not met.",
    "2493" : "Business Rule violation - WhyEmployerCouldNotAccommodate (B-213) must be null if required or optional conditions are not met.",
    "2494" : "Business Rule violation - WorkersCompComments (B-211) must be null if required or optional conditions are not met.",
    "2495" : "Business Rule violation - ReceivePension401KInd (B-210) required if EmployerSepReasonCode (B-20) does not equal 20, 21, 23.",
    "2496" : "Business Rule violation - ReceivePension401KInd (B-210) must be null if required or optional conditions are not met.",
    "2497" : "Business Rule violation - Pension401K (B-218) required once if ReceivePension401KInd (B-210) is 1 or 2.",
    "2498" : "Business Rule violation - Pension401K (B-218) required twice if ReceivePension401KInd (B-210) is 3.",
    "2499" : "Business Rule violation - Pension401K (B-218) can only have one pension and one 401K.",
    "2500" : "Business Rule violation - Pension401K (B-218) must be null if required or optional conditions are not met.",
    "2501" : "Business Rule violation - Pension401KFrequencyCode (B-218.2) sequence number ${sequencenumber} required if Pension401KInd (B-218.1) is 1 for Pension.",
    "2502" : "Business Rule violation - Pension401KFrequencyCode (B-218.2) sequence number ${sequencenumber} required if PaidOut401KToClaimant (B-224) is Y for Yes.",
    "2503" : "Business Rule violation - Pension401KFrequencyCode (B-218.2) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2504" : "Business Rule violation - Pension401KAmountPerPeriod (B-218.3) sequence number ${sequencenumber} required if  Pension401KAmountPerPeriodUnknown (B218.31) is null and Pension401KPeriodFrequencyCode (B-218.2) is D, W, B, S, M, Q, L.",
    "2505" : "Business Rule violation - Pension401KAmountPerPeriod (B-218.3) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2506" : "Business Rule violation - Pension401KAmountPerPeriodUnknown (B-218.31) sequence number ${sequencenumber} required if Pension401KAmountPerPeriod (B-218.3) is null.",
    "2507" : "Business Rule violation - Pension401KAmountPerPeriodUnknown (B-218.31) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2508" : "Business Rule violation - DatePension401KIssued (B-218.4) sequence number ${sequencenumber} required if Pension401KPeriodFrequencyCode (B-218.2) is D, W, B, S, M, Q, L and DatePension401KIssuedUnknown (B-218.41) is null.",
    "2509" : "Business Rule violation - DatePension401KIssued (B-218.4) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2510" : "Business Rule violation - DatePension401KIssuedUnknown (B-218.41) sequence number ${sequencenumber} required if Pension401KPeriodFrequencyCode (B-218.2) is D, W, B, S, M, Q, L. and DatePension401KIssued (B-218.4) is null.",
    "2511" : "Business Rule violation - DatePension401KIssuedUnknown (B-218.41) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2512" : "Business Rule violation - WhoContributedPension401K (B-218.5) sequence number ${sequencenumber} required if Pension401KPeriodFrequencyCode (B-218.2) is D, W, B, S, M, Q, L, or Z.",
    "2513" : "Business Rule violation - WhoContributedPension401K (B-218.5) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2514" : "Business Rule violation - ClaimantPensionContributionPercent (B-218.51) sequence number ${sequencenumber} required if WhoContributedPension401K (B-218.5) is C for Claimant or B for Both, and ClaimantPension401KContributionPercentUnknown (B-218.52) is null.",
    "2515" : "Business Rule violation - ClaimantPensionContributionPercent (B-218.51) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2516" : "Business Rule violation - ClaimantPension401KContributionPercentUnknown (B-218.52) sequence number ${sequencenumber} required if WhoContributedPension401K (B-218.5) is C for Claimant or B for Both and ClaimantPensionContributionPercent (B-218.51) is null.",
    "2517" : "Business Rule violation - ClaimantPension401KContributionPercentUnknown (B-218.52) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2518" : "Business Rule violation - EmployerPension401KContributionPercent (B-218.53) sequence number ${sequencenumber} required if WhoContributedPension401K (B-218.5) is E for Employer or B for Both,  and EmployerPension401KContributionPercentUnknown (B-218.54) is null.",
    "2519" : "Business Rule violation - EmployerPension401KContributionPercent (B-218.53) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2520" : "Business Rule violation - EmployerPension401KContributionPercentUnknown (B218.54) sequence number ${sequencenumber} required if WhoContributedPension401K (B-218.5) is E for Employer or B for Both and EmployerPension401KContributionPercent (B-218.53) is null.",
    "2521" : "Business Rule violation - EmployerPension401KContributionPercentUnknown (B218.54) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2522" : "Business Rule violation - EmployerLastContributionDate (B-218.55) sequence number ${sequencenumber} required if WhoContributedPension401K (B-218.5) is E for Employer or B for Both, and EmployerLastContributionDateUnknown (B-218.56) is null.",
    "2523" : "Business Rule violation - EmployerLastContributionDate (B-218.55) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2524" : "Business Rule violation - EmployerLastContributionDateUnknown (B-218.56) sequence number ${sequencenumber} required if WhoContributedPension401K (B-218.5) is E for Employer or B for Both, and EmployerLastContributionDate (B-218.55) is null.",
    "2525" : "Business Rule violation - EmployerLastContributionDateUnknown (B-218.56) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2526" : "Business Rule violation - Pension401KComments (B-218.6) sequence number ${sequencenumber} must be null if required or optional conditions are not met.",
    "2527" : "Business Rule violation - MandatoryPension (B-29) required  if ReceivePension401Kind (B-210) is 1 for Pension or 3 for Pension and 401K.",
    "2528" : "Business Rule violation - MandatoryPension (B-29) must be null if required or optional conditions are not met.",
    "2529" : "Business Rule violation - FullAmount401KRolledOver (B-222) required if ReceivePension401KInd (B-210) is 2 for 401K or 3 for Pension and 401K.",
    "2530" : "Business Rule violation - FullAmount401KRolledOver (B-222) must be null if required or optional conditions are not met.",
    "2531" : "Business Rule violation - Percentage401KRolledOver (B-223) required if FullAmount401KRolledOver (B-222) is N for No and  Percentage401KRolledOverUnknown (B-215) is null.",
    "2532" : "Business Rule violation - Percentage401KRolledOver (B-223) must be null if required or optional conditions are not met.",
    "2533" : "Business Rule violation - Percentage401KRolledOverUnknown (B-215) required if FullAmount401KRolledOver (B-222) is N for No and Percentage401KRolledOver (B-223) is null.",
    "2534" : "Business Rule violation - Percentage401KRolledOverUnknown (B-215) must be null if required or optional conditions are not met.",
    "2535" : "Business Rule violation - PaidOut401KToClaimant (B-224) required if FullAmount401KRolledOver (B-222) is N for No.",
    "2536" : "Business Rule violation - PaidOut401KToClaimant (B-224) must be null if required or optional conditions are not met.",
    "2538" : "Business Rule violation - ExternalBusinessContactInformation (B-214) - If ExternalBusinessContactInformation (B-214) exists, then at least one of B-214.2 - B-214.5 must be filled in.",
    "2539" : "Business Rule violation - ExternalBusinessContactInformation (B-214) must be null if required or optional conditions are not met.",
    "2540" : "Business Rule violation - AdditionalSeparationAckInd (B-93) required if EmployerSepReasonCode (B-20) does not equal 20, 21, or 23, and Request has an ActionableAttachment (A-28.4) of 3 or 4.",
    "2541" : "Business Rule violation - AdditionalSeparationAckInd (B-93) must be null if required or optional conditions are not met.",
    "2542" : "Business Rule violation - AttachmentInd (B-92) required if EmployerSepReasonCode (B-20) does not equal 20, 21, or 23.  ",
    "2543" : "Business Rule violation - AttachmentInd (B-92) must be null if required or optional conditions are not met.",
    "2544" : "Business Rule violation - Attachment (B-51) required If AttachmentInd (B-92) is Y for Yes.",
    "2545" : "Business Rule violation - Attachment (B-51) must be null if required or optional conditions are not met.",
    "2546" : "Business Rule violation - PreparerTypeCode (B-52) must be T for Third Party Administrator if EmployerSepReasonCode (B-20) is 21 for TPA does not represent this employer.",
    "2547" : "Business Rule violation - PreparerCompanyName (B-53) required if PreparerTypeCode (B-52) = T for Third Party Administrator.",
    "2548" : "Business Rule violation - PreparerCompanyName (B-53) must be null if required or optional conditions are not met.",
    "2549" : "Business Rule violation - ReturnToWorkInd (B-21) required if WhyNotReturning (B-166) is 16, 18, or 19. ",
    "2550" : "Business Rule violation - NotWorkingAvailableHoursReason (B-24) required if WhyNotReturning (B-166) is 18 for Disaster Related.",
    "2551" : "Business Rule violation - DischargeReasonCode (B-34) required if WhyNotReturning (B-166) is 3 for Discharged or 5 for Asked to Resign. ",
    "2552" : "Business Rule violation - DischargeReasonCode (B-34) required if WhyNotReturning (B-166) is 6 for Voluntary Quit and VoluntarySepReasonCode (B-44) is 5 for In Lieu of Discharge and if InLieuInd (B-185) is Y for Yes ",
    "2553" : "Business Rule violation - DischargeReasonComments (B-43) required if InLieuInd (B-185) is N for No",
    "2554" : "Business Rule violation - PriorIncidentInd (B-94) required if WhyNotReturning (B-166) is 3 for Discharged or 5 for Asked to Resign.",
    "2555" : "Business Rule violation - PriorIncidentInd (B-94) required if WhyNotReturning (B-166) is 6 for Voluntary Quit/Separation and VoluntarySepReasonCode (B-44) = 5 for In Lieu of Discharge and InLieuInd (B-195) is Y for Yes",
    "2556" : "Business Rule violation - VoluntarySepReasonCode (B-44) required if WhyNotReturning (B-166) is 6 for 'Voluntary Quit'.",
    "2557" : "Business Rule violation - MandatoryRetirementInd (B-28) required if WhyNotReturning (B-166) is 14 for 'Retirement'.",
    "2558" : "Business Rule violation - WhyRetireComments (B-132) required if WhyNotReturning (B-166) is 14 for 'Retirement'.",
    "2559" : "Business Rule violation - LaborDisputeTypeInd (B-25) required if WhyNotReturning (B-166) is 16 for Labor Dispute.",
    "2560" : "Deprecated",
    "2561" : "Deprecated",
    "2562" : "Business Rule violation - DateDisputeBegan (B-174) required if WhyNotReturning (B-166) is 16 for Labor Dispute.",
    "2563" : "Business Rule violation - LaborDisputeEndedInd (B-175) required if WhyNotReturning (B-166) is 16 for Labor Dispute.",
    "2564" : "Business Rule violation - ReplacementWorkersHiredInd (B-177) required if WhyNotReturning (B-166) is 16 for Labor Dispute.",
    "2565" : "Business Rule violation - ClmtStrikingUnionMemberInd (B-178) required if WhyNotReturning (B-166) is 16 for Labor Dispute.",
    "2566" : "Business Rule violation - EmployerSepReasonComments (B-33) required if WhyNotReturning (B-166) is 19 for Not Listed Above.",
    "2567" : "Business Rule violation - RefuseToProvideInd (B-241) required if WhyNotReturning (B-166) is 99 for Refuse to Provide.",
    "2568" : "Business Rule violation - SeparationDateInd (B-226) must be null if RelationshipEndedInd (B-195) is N or if EmployerSepReasonCode is 1, 4, 7, 9, 10, 11, 12, 13, 16 or 17.",
    "2569" : "Business Rule violation - DateFailedToReport (B-115.1) sequence number ${sequencenumber} must be more recent than or equal to the current date minus 104 weeks and not more than the current date.",
    "2570" : "Business Rule violation - The total of ClaimantPensionContributionPercent (B-218.51) and EmployerPension401KContributionPercent (B-218.53) in sequence number ${sequencenumber} cannot exceed 100.",
    "2571" : "Business Rule violation - DateMadeContact (B-117) must be after or equal to EmployerReportedClaimantFirstDayofWork (B-12) and not more than the current date.",
    "2572" : "Business Rule violation - If EmployerReportedClaimantFirstDayofWork (B-12) is not provided, DateMadeContact (B-117) must not be more than ten years prior to the request date and cannot be greater than the current date.",
    "2573" : "Business Rule violation - ClaimantProvidedIntendedLastDayWork (B-98) must not be more than ten years prior to ClaimEffectiveDate (B-2) and not more than the request date plus one year in the future.",
    "2574" : "Business Rule violation - FirstDayOfContract (B-183) must not be more than ten years prior to ClaimEffectiveDate (B-2) and not more than the request date plus one year in the future.",
    "2575" : "Business Rule violation - FirstDayOfBreak (B-124) must not be more than ten years prior to ClaimEffectiveDate (B-2) and not more than the request date plus ten years in the future.",
    "2576" : "Business Rule violation - DateDisputeBegan (B-174) must be in the past and more recent than the request date minus ten years.",
    "2577" : "Business Rule violation - RepContractTermDate (B-194) must be in the past and more recent than the request date minus one hundred years.",
    "2578" : "Business Rule violation - AllocationBeginDate (B-26.6) sequence number ${sequencenumber} must not be more than ten years prior to ClaimEffectiveDate (B-2) and not more than the request date plus two years in the future.",
    "2579" : "Business Rule violation - AllocationEndDate (B-26.7) sequence number ${sequencenumber} must not be more than ten years prior to ClaimEffectiveDate (B-2) and not more than the request date plus two years in the future.",
    "2580" : "Business Rule violation - DateRemunerationIssued (B-26.4) sequence number ${sequencenumber} must be more recent than or equal to ClaimEffectiveDate (B-2) minus two years and not more than request date plus five years.",
    "2581" : "Business Rule violation - DatePension401KIssued (B-218.4) sequence number ${sequencenumber} must be more recent than or equal to ClaimEffectiveDate (B-2) minus two years and not more than request date plus five years.",
    "2582" : "Business Rule violation - EmployerLastContributionDate (B-218.55) sequence number ${sequencenumber} must not be more than one hundred years prior to ClaimEffectiveDate (B-2) and not more than the request date plus one year in the future.",
    "2583" : "Business Rule violation - AllocationEndDate (B-26.7) cannot be prior to AllocationBeginDate (B-26.6) if AllocationBeginDate is not null.",
    "2584" : "Business Rule violation - RemunerationPeriodFrequencyCode (B-26.3) can only be L for Lump Sum or Z for Not Able to Provide if AllocationRequiredInd (A-36) is N.",
    "2585" : "Business Rule violation - ContractEmployee1099Ind (B-230) cannot be selected if EmployerSepReasonCode (B-20) is 20, 21, or 23 or if TemporaryStaffingInd (B-246) is Y.",
    "2586" : "Business Rule violation - EmployerSepReasonCode (B-20) of 20, 21, or 23 cannot be selected if TemporaryStaffingInd (B-246) is Y or ContractEmployee1099Ind (B-230) is Y.",
    "2587" : "Business Rule violation - TemporaryStaffingInd (B-246) cannot be selected if EmployerSepReasonCode (B-20) is 20, 21, or 23 or if ContractEmployee1099Ind (B-230) is Y.",
    "2588" : "Business Rule violation - DateOfInjury (B-202) must be in the past and more recent than the request date minus one hundred years.",
    "2589" : "Business Rule violation - DateAppliedForWorkersComp (B-204) must be in the past and more recent than the request date minus one hundred years.",
    "2590" : "Business Rule violation - TempAssignmentLastDay (B-199) must be in the past and more recent than the request date minus one hundred years.",
    "2591" : "Business Rule violation - PrevTempAssignmentStartDate (B-219.1) sequence number ${sequencenumber}  must be in the past and more recent than the request date minus one hundred years.",
    "2592" : "Business Rule violation - NewTempAssignmentDateOfferMade (B-220) must be in the past and more recent than the request date minus one hundred years.",
    "2593" : "Business Rule violation - NewTempAssignmentStartDate (B-200) must be more recent or equal to NewTempAssignmentDateOfferMade (B-220) and cannot be greater than current date.",
    "2594" : "Business Rule violation - NewTempAssignmentDateRefused (B-238) must be more recent or equal to NewTempAssignmentDateOfferMade (B-220) and cannot be greater than current date.",
    "2595" : "Business Rule violation - DateClaimantReleased (B-209) must be in the past and more recent than the request date minus one hundred years."
  }